[
  {
    "chapter": "1 - Bridge Works",
    "question": "Under what situation shall engineers use jacking at one end only and from both ends in prestressing work?  During prestressing operation at one end, frictional losses will occur and the prestressing force decreases along the length of tendon until reaching the other end. These frictional losses include the friction induced due to a change of curvature of tendon duct and also the wobble effect due to deviation of duct alignment from the centerline. Therefore, the prestress force in the mid-span or at the other end will be greatly reduced in case the frictional loss is high. Consequently, prestressing, from both ends for a single span i.e. prestressing one-half of total tendons at one end and the remaining half at the other end is carried out to enable a even distribution and to provide symmetry of prestress force along the structure.  In fact, stressing at one end only has the potential advantage of lower cost when compared with stressing from both ends. For multiple spans (e.g. two spans) with unequal span length, jacking is usually carried out at the end of the longer span so as to provide a higher prestress force at the location of maximum positive moment. On the contrary, jacking from the end of the shorter span would be conducted if the negative moment at the intermediate support controls the prestress force. However, if the total span length is sufficiently long, jacking from both ends should be considered."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What is “preset” during installation of bridge bearings?  “Preset” is a method to reduce the size of upper plates of sliding bearings in order to save the material cost. The normal length of a upper bearing plate should be composed of the following components: length of bearing + 2 x irreversible movement + 2 x reversible movement. Initially the bearing is placed at the mid-point of the upper bearing plate without considering the directional effect of irreversible movement. However, as irreversible movement normally takes place at one direction only, the bearing is displaced/presetted a distance of (irreversible movement/2) from the mid-point of bearing in which the length of upper plate length is equal to the length of bearing + irreversible movement + 2 x reversible movement. In this arrangement, the size of upper plate is minimized in which irreversible movement takes place in one direction only and there is no need to include the component of two irreversible movements in the upper plate.  Note: “Preset” refers to the displacement of a certain distance of sliding bearings with respect to upper bearing plates during installation of bearings."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In incremental launching method of bridge construction, what are the measures adopted to enhance sufficient resistance of the superstructure during the launching process?  (i) During the launching process the leading edge of the superstructure is subject to a large hogging moment. In this connection, steel launching nose typically about 0.6-0.65 times span length is provided at the leading edge to reduce the cantilever moment. Sometimes, instead of using launching nose a tower and stay system are designed which serves the same purpose. 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU  5 (ii) The superstructure continually experiences alternative sagging and hogging moments during incremental launching. Normally, a central prestress is provided in which the compressive stress at all points of bridge cross section is equal. In this way, it caters for the possible occurrence of tensile stresses in upper and lower part of the cross section when subject to hogging and sagging moment respectively. Later when the whole superstructure is completely launched, continuity prestressing is performed in which the location and design of continuity tendons are based on the bending moments in final completed bridge condition and its provision is supplementary to the central prestress. (iii)For very long span bridge, temporary piers are provided to limit the cantilever moment."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In bridge widening projects, the method of stitching is normally employed for connecting existing deck to the new deck. What are the problems associated with this method in terms of shrinkage of concrete?  In the method of stitching, it is a normal practice to construct the widening part of the bridge at first and let it stay undisturbed for several months. After that, concreting will then be carried out for the stitch between the existing deck and the new deck. In this way, the dead load of the widened part of bridge is supported by itself and loads arising from the newly constructed deck will not be transferred to the existing deck which is not designed to take up these extra loads.  One of the main concerns is the effect of stress induced by shrinkage of newly widened part of the bridge on the existing bridge. To address this problem, the widened part of the bridge is constructed a period of time (say 6-9 months) prior to stitching to the existing bridge so that shrinkage of the new bridge will take place within this period and the effect of shrinkage stress exerted on the new bridge is minimized.  Traffic vibration on the existing bridge causes adverse effect to the freshly placed stitches. To solve this problem, rapid hardening cement is used for the stitching concrete so as to shorten the time of setting of concrete. Moreover, the stitching work is designed to be carried out at nights of least traffic (Saturday night) and the existing bridge may even be closed for several hours (e.g. 6 hours) to let the stitching works to left undisturbed.  Sometimes, longitudinal joints are used in connecting new bridge segments to existing bridges. The main problem associated with this design is the safety concern of vehicles. The change of frictional coefficients of bridge deck and longitudinal joints when vehicles change traffic lanes is very dangerous to the vehicles. Moreover, maintenance of longitudinal joints in bridges is quite difficult.  Note: Stitching refers to formation of a segment of bridge deck between an existing bridge and a new bridge."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What are the advantages of assigning the central pier and the abutment as fixed piers?  (i) For abutment pier to be assigned as fixed pier while the bridge is quite long, the longitudinal loads due to earthquake are quite large. As the earthquake loads are resisted by fixed piers, the size of fixed piers will be large and massive. In this connection, for better aesthetic appearance, the selection of abutment as fixed piers could accommodate the large size and massiveness of piers. Normally abutments are relatively short in height and for the same horizontal force, the bending moment 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU  6 induced is smaller. (ii) For the central pier to be selected as the fixed pier, the bridge deck is allowed to move starting from the central pier to the end of the bridge. However, if the fixed pier is located at the abutment, the amount of movement to be incorporated in each bearing due to temperature variation, shrinkage, etc. is more than that when the fixed pier is located at central pier. Therefore, the size of movement joints can be reduced significantly."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Sometimes the side of concrete bridges is observed to turn black in colour. What is the reason for this phenomenon?  In some cases, it may be due to the accumulation of dust and dirt. However, for the majority of such phenomenon, it is due to fungus or algae growth on concrete bridges. After rainfall, the bridge surface absorbs water and retains it for a certain period of time. Hence, this provides a good habitat for fungus or algae to grow. Moreover, atmospheric pollution and proximity of plants provide nutrients for their growth. Improvement in drainage details and application of painting and coating to bridges help to solve this problem. Reference is made to Sandberg Consulting Engineers Report 18380/X/01."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In prestressing work, if more than one wire or strand is included in the same duct, why should all wires/strands be stressed at the same time?  If wires/strands are stressed individually inside the same duct, then those stressed strand/wires will bear against those unstressed ones and trap them. Therefore, the friction of the trapped wires is high and is undesirable."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In the design of elastomeric bearings, why are steel plates inserted inside the bearings?  For elastomeric bearing to function as a soft spring, the bearing should be allowed for bulging laterally and the compression stiffness can be increased by limiting the amount of lateral bulging. To increase the compression stiffness of elastomeric bearings, metal plates are inserted. After the addition of steel plates, the freedom to bulge is restricted and the deflection is reduced when compared with bearings without any steel plates under the same load. Tensile stresses are induced in these steel plates during their action in limiting the bulging of the elastomer. This in turn would limit the thickness of the steel plates.  However, the presence of metal plates does not affect the shear stiffness of the elastomeric bearings.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU  7 Fig. 1.1 Effect of steel plate in elastomeric bearing."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "How to determine the size of elastomeric bearings?  For elastomeric bearing, the vertical load is resisted by its compression while shear resistance of the bearing controls the horizontal movements. The design of elastomeric bearings are based on striking a balance between the provision of sufficient stiffness to resist high compressive force and the flexibility to allow for translation and rotation movement.  The cross sectional area is normally determined by the allowable pressure on the bearing support. Sometimes, the plan area of bearings is controlled by the maximum allowable compressive stress arising from the consideration of delamination of elastomer from steel plates. In addition, the size of elastomeric bearings is also influenced by considering the separation between the structure and the edge of bearing which may occur in rotation because tensile stresses deriving from separation may cause delamination. The thickness of bearings is designed based on the limitation of its horizontal stiffness and is controlled by movement requirements. The shear strain should be less than a certain limit to avoid the occurrence of rolling over and fatigue damage. The vertical stiffness of bearings is obtained by inserting sufficient number of steel plates."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In a curved prestressed bridge, how should the guided bearings in piers of the curved region be oriented with respect to the fixed bearing in abutment?  To determine the orientation of guided bearings, one should understand the movement of curved region of a prestressed bridge. Movement of prestress and creep are tangential to the curvature of the bridge (or along longitudinal axis) while the movement due to temperature and shrinkage effects are in a direction towards the fixed pier. If the direction of guided bearings is aligned towards the fixed bearing in the abutment, the difference in direction of pretress and creep movement and the guided direction towards fixed bearing would generate a locked-in force in the bridge system. The magnitude of the lock-in force is dependent on the stiffness of deck and supports. If the force is small, it can be designed as additional force acting on the support and deck. However, if the force is large, temporary freedom of movement at the guided bearings has to be provided during construction.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU  8  Fig. 1.2 The diagram showing how the guided bearings in piers of the curved region is oriented with respect to the fixed bearing in abutment."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In the construction of a two-span bridge (span length = L) by using span-by-span construction, why is a length of about 1.25L bridge segment is constructed in the first phase of construction?  Basically, there are mainly three reasons for this arrangement: (i) The permanent structure is a statically indeterminate structure. During construction by using span-by-span construction, if the first phase of construction consists of the first span length L only, then the sagging moment in the mid span of the partially completed bridge is larger than that of completed two-span permanent structure. To avoid such occurrence, 0.25L of bridge segment is extended further from the second pier which provides a counteracting moment, thereby reducing the mid-span moment of the partially completed bridge. (ii) The position of 1.25 L countering from the first pier is the approximate location of point of contraflexure (assume that the two-span bridge is uniformly loaded) in which the bridge moment is about zero in the event of future loaded bridge. Therefore, the design of construction joint in this particular location has the least adverse effect on the structural performance of the bridge. (iii) In case of a prestressed bridge, prestressing work has to be carried out after the construction of first segment of the bridge. If the prestressing work is conducted at the first pier which is heavily reinforced with reinforcement, it is undesirable when compared with the prestressing location at 1.25L from the first pier where there is relatively more space to accommodate prestressing works.  Note: Span-by-span construction means that a bridge is constructed from one bridge span to another until its completion."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What are the advantages of piers constructed monolithically with the bridge deck over usage of bearings?  Basically, piers constructed monolithically with the bridge deck are advantageous in the following ways:  (i) Movement of the bridge deck is achieved by the bending deformation of long and 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU  9 slender piers. In this way, it saves the construction cost of bearings by using monolithic construction between bridge deck and piers. Moreover, it is not necessary to spend extra effort to design for drainage details and access for bearing replacement. On the other hand, in maintenance aspect substantial cost and time savings could be obtained by using monolithic construction instead of using bearings as bridge articulation. (ii) Monolithic construction possesses the shortest effective Euler buckling length for piers because they are fixed supports at the interface between bridge deck and piers.  Note: Monolithic construction means that piers are connected to bridge decks without any joints and bearings."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Are diaphragms necessary in the design of concrete box girder bridges?  Diaphragms are adopted in concrete box girder bridges to transfer loads from bridge decks to bearings. Since the depth of diaphragms normally exceeds the width by two times, they are usually designed as deep beams. However, diaphragms may not be necessary in case bridge bearings are placed directly under the webs because loads in bridge decks can be directly transferred to the bearings based on Jorg Schlaich & Hartmut Scheef (1982). This arrangement suffers from the drawback that changing of bearings during future maintenance operation is more difficult.  In fact, diaphragms also contribute to the provision of torsional restraint to the bridge deck."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What is the advantage of sliding bearings over roller bearings?  In roller bearing for a given movement the roller bearing exhibit a change in pressure centre from its original position by one-half of its movement based on David J. Lee. However, with sliding bearing a sliding plate is attached to the upper superstructure and the moving part of bearing element is built in the substructure. It follows that there is no change in pressure center after the movement."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What are the three major types of reinforcement used in prestressing?  (i) Spalling reinforcement Spalling stresses are established behind the loaded area of anchor blocks and this causes breaking away of surface concrete. These stresses are induced by strain incompatibility with Poisson’s effects or by the shape of stress trajectories.  (ii) Equilibrium reinforcement Equilibrium reinforcement is required where there are several anchorages in which prestressing loads are applied sequentially.  (iii) Bursting Reinforcement Tensile stresses are induced during prestressing operation and the maximum bursting stress occurs where the stress trajectories are concave towards the line of action of the load. Reinforcement is needed to resist these lateral tensile forces."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Why is the span length ratio of end span/approach span to its neighboring inner spans usually about 0.75?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 10 From aesthetic point of view, an odd number of spans with a decrease in length in the direction of abutment is desirable. Moreover, spans of equal length are found to be boring. However, the arrangement of irregular span lengths is not recommended because it gives a feeling of uneasiness.  From structural point of view, for a multi-span bridge with equal span length, the sagging moment at the mid-span of the end span/approach span is largest. In order to reduce this moment, the span length of end span/approach span is designed to be 0.75 of inner spans. However, this ratio should not be less than 0.40 because of the effect of uplifting at the end span/approach span support.  Note: End span refers to the last span in a continuous bridge while approach span refers top the first span of a bridge."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In the design of a simply supported skew bridge, which direction of reinforcement should be provided?  In the conventional design of steel reinforcement for a simply supported skew bridge, a set of reinforcement is usually placed parallel to free edge while the other set is designed parallel to the fixed edge. However, this kind of arrangement is not the most efficient way of placing the reinforcement. The reason is that in some parts of the bridge, the moment of resistance is provided by an obtuse angle formed by the reinforcement bars which is ineffective in resisting flexure. In fact, the most efficient way of the arrangement of reinforcement under most loading conditions is to place one set of bars perpendicular to the fixed edge while placing the other set parallel to the fixed end as recommended by L. A. Clark (1970). In this way, considerable savings would be obtained from the orthogonal arrangement of reinforcement.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 11 Fig. 1.3 The arrangement of reinforcement in skewed bridge."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What are the functions of grout inside tendon ducts?  Grout in prestressing works serves the following purposes:  (i) Protect the tendon against corrosion. (ii) Improve the ultimate capacity of tendon. (iii) Provide a bond between the structural member and the tendon. (iv) In case of failure, the anchorage is not subject to all strain energy."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What is the consideration in selecting the orientation of wing walls in the design of bridge abutments?  There are three common arrangements of wing walls in bridge abutments based on Dr. Edmund C Hambly (1979):  (i) Wing walls parallel to abutments This is the simplest and shortest time to build but is not the most economical design. This design has the advantage that it has least disturbance to existing slope embankment.  (ii) Wing walls at an angle to abutments This is the most economical design among the three options in terms of material cost.  (iii) Wing walls perpendicular to abutments Though it is not the most economical design, the wing walls provide a continuous 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 12 alignment with bridge decks which provide supports to parapets. However, they cause disturbances to adjacent structures and utility services during construction. Moreover, if the bridge is curved, the wing walls may hinder the road curvature.  One the other hand, when the wing walls are structurally connected to the abutment, then structural advantage can be taken by the stability of box structure.      Fig. 1.4 Different orientation of wing walls."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "In joints of precast concrete bridge segments, what are the functions of applying epoxy adhesive? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 13  Epoxy adhesive is applied in these joints for the following purposes according to International Road Federation (1977):  (i) It seals up the joints completely between precast concrete segments to protect the prestressing tendons; (ii) By filling voids and irregularities along the segment joints, it helps to reduce stress concentrations otherwise it will be developed; and (iii) It helps in transferring of shear between the joints in case a large single shear key is used."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Under what situation should engineers use pot bearings instead of elastomeric bearings?  In the event of high vertical loads combined with large angle of rotations, rubber bearings are undesirable when compared with pot bearings. For instance, elastomeric bearings require large bearing surfaces so that compression can be maintained between the contact surfaces between the bearings and piers. Moreover, it also leads to uneven distribution of stress on the piers and some of these highly induced stresses may damage the piers. Consequently, pot bearings are better alternatives than elastomeric bearings in such an scenario as suggested by David J. Lee."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "What are the shortcomings of grillage analysis which is commonly used in structural analysis of bridges?  Grillage analysis suffers from the following shortcomings based on E. C. Hambly:  (i) For coarse mesh, torques may not be identical in orthogonal directions. Similarly, twists may differ in orthogonal directions. (ii) Moment in any beams is mainly proportional to its curvature only. However, moment in an element depends on the curvatures in the beam’s direction and its orthogonal direction."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Polytetrafluoroethylene (PTFE) is commonly used in sliding bearings. Why?  The choice of sliding surface of bearings is of vital importance because the sliding surfaces generate frictional forces which are exerted on the bearings and substructure of the bridge. For instance, PTFE and lubricated bronze are commonly choices of sliding surfaces for bearings. PTFE is a flurocarbon polymer which possesses good chemical resistance and can function in a wide range of temperature. The most important characteristic of this material is its low coefficient of friction. PTFE has the lowest coefficients of static and dynamic friction of any solid with absence of stick-slip movement (David J. Lee). The coefficient of friction is found to decrease with an increase in compressive stress. However, PTFE do have some demerits like high thermal expansion and low compressive strength.  In designing the complementary contact plate with PTFE sliding surface, stainless steel plates are normally selected where the plates should be larger than PTFE surface to allow movement without exposing the PTFE. Moreover, it is recommended that the stainless steel surface be positioned on top of the PTFE surface to avoid contamination of dirt and rubbish. Lubricants are sometimes introduced to reduce the friction between the PTFE surface and 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 14 the upper stainless steel plate. Hence, the PTFE may be designed with dimples to avoid the lubricant from squeezing out under repeated translation movements."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "Should raking piles of a bridge abutment be placed under an embankment?  For a bridge abutment to be supported on raking piles with different orientations, the movement between the ground and the pile group is difficult to predict. For instance, if some of the raking piles of the bridge abutment are extended beneath an embankment, then the settlement of embankment behind the abutment may cause the raking piles to experience severe bending moment and damage the piles as recommended by Dr. Edmund C Hambly (1979)."
  },
  {
    "chapter": "1 - Bridge Works",
    "question": "How do engineer determine the number of cells for concrete box girder bridges?  If the depth of a box girder bridge exceeds 1/6 or 1/5 of the bridge width, then it is recommended to be designed as a single cell box girder bridge. However, if the bridge depth is smaller than 1/6 of the bridge width, then a twin-cell or multiple cell is a better choice as suggested by Jorg Schlaich & Hartmut Scheef (1982). However, one should note that even for wider bridges with small depths, the number of cells should be minimized because there is not much improvement in transverse load distribution when the number of cells of box girder is increased to three or more."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is sucker deck principle for variable depth bridge decks?  For a variable depth bridge deck, the depth of continuous multi-span bridge deck is increased in pier supports and this absorbs sagging moments in the mid-span with the consequent increase in hogging moments in pier supports. As a result, the mid-span depth can be significantly reduced due to the reduction in sagging moment. In essence, this sucker deck principle is applied in locations where headroom requirement is of great concern. Moreover, in terms of structural performance, sucker decks are effective in reducing dead loads than voided slab of equivalent uniform depth for span length between 20-40m. In terms of aesthetics point of view, the public tends to appreciate the structural form of arches and curved soffit rather than boring uniform deck alignment. Reference is made to Brian Pritchard (1992). 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 15"
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What are the functions of different components of a typical expansion joint?  In a typical expansion joint, it normally contains the following components: joint sealant, joint filler, dowel bar, PVC dowel sleeve, bond breaker tape and cradle bent.  Joint sealant: it seals the joint width and prevents water and dirt from entering the joint and causing dowel bar corrosion and unexpected joint stress resulting from restrained movement.  Joint filler: it is compressible so that the joint can expand freely without constraint. Someone may doubt that even without its presence, the joint can still expand freely. In fact, its presence is necessary because it serves the purpose of space occupation such that even if dirt and rubbish are intruded in the joint, there is no space left for their accommodation.  Dowel bar: This is a major component of the joint. It serves to guide the direction of movement of concrete expansion. Therefore, incorrect direction of placement of dowel bar will induce stresses in the joint during thermal expansion. On the other hand, it links the two adjacent structures by transferring loads across the joints.  PVC dowel sleeve: It serves to facilitate the movement of dowel bar. On one side of the joint, the dowel bar is encased in concrete. On the other side, however, the PVC dowel sleeve is bonded directly to concrete so that movement of dowel bar can take place. One may notice that the detailing of normal expansion joints in Highways Standard Drawing is in such a way that part of PVC dowel sleeve is also extended to the other part of the joint where the dowel bar is directly adhered to concrete. In this case, it appears that this arrangement prevents the movement of joint. If this is the case, why should designers purposely put up such arrangement? In fact, the rationale behind this is to avoid water from getting into contact with dowel bar in case the joint sealant fails. As PVC is a flexible material, it only minutely hinders the movement of joint only under this design.  Bond breaker tape: As the majority of joint sealant is applied in liquid form during construction, the bond breaker tape helps to prevent flowing of sealant liquid inside the joint .  Cradle bar: It helps to uphold the dowel bar in position during construction."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "If on-site slump test fails, should engineers allow the contractor to continue the concreting works?  This is a very classical question raised by many graduate engineers. In fact, there are two schools of thought regarding this issue.  The first school of thought is rather straightforward: the contractor fails to comply with contractual requirements and therefore as per G. C. C. Clause 54 (2)(c) the engineer could order suspension of the Works. Under the conditions of G. C. C. Clause 54(2)(a) – (d), the contractor is not entitled to any claims of cost which is the main concern for most engineers. This is the contractual power given to the Engineer in case of any failure in tests required 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 16 by the contract, even though some engineers argue that slump tests are not as important as other tests like compression test.  The second school of thought is to let the contractor to continue their concreting works and later on request the contractor to prove that the finished works comply with other contractual requirements e.g. compression test. This is based upon the belief that workability is mainly required to achieve design concrete compression strength. In case the compression test also fails, the contractor should demolish and reconstruct the works accordingly. In fact, this is a rather passive way of treating construction works and is not recommended because of the following reasons:  (i) Workability of freshly placed concrete is related not only to strength but also to durability of concrete. Even if the future compression test passes, failing in slump test indicates that it may have adverse impact to durability of completed concrete structures. (ii) In case the compression test fails, the contractor has to deploy extra time and resources to remove the work and reconstruct them once again and this slows down the progress of works significantly. Hence, in view of such likely probability of occurrence, why shouldn’t the Engineer exercise his power to stop the contractor and save these extra time and cost?"
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is the function of shear keys in the design of retaining walls?  In determining the external stability of retaining walls, failure modes like bearing failure, sliding and overturning are normally considered in design. In considering the criterion of sliding, the sliding resistance of retaining walls is derived from the base friction between the wall base and the foundation soils. To increase the sliding resistance of retaining walls, other than providing a large self-weight or a large retained soil mass, shear keys are to be installed at the wall base. The principle of shear keys is as follows:  The main purpose of installation of shear keys is to increase the extra passive resistance developed by the height of shear keys. However, active pressure developed by shear keys also increases simultaneously. The success of shear keys lies in the fact that the increase of passive pressure exceeds the increase in active pressure, resulting in a net improvement of sliding resistance.  On the other hand, friction between the wall base and the foundation soils is normally about a fraction of the angle of internal resistance (i.e. about 0.8φ ) where φ is the angle of internal friction of foundation soil. When a shear key is installed at the base of the retaining wall, the failure surface is changed from the wall base/soil horizontal plane to a plane within foundation soil. Therefore, the friction angle mobilized in this case is φ instead of 0.8φ in the previous case and the sliding resistance can be enhanced."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "In designing concrete structures, normally maximum aggregate sizes are adopted with ranges from 10mm to 20mm. Does an increase of maximum aggregate size benefit the structures?  To answer this question, let’s consider an example of a cube. The surface area to volume ratio of a cube is 6/b where b is the length of the cube. This implies that the surface area to volume ratio decreases with an increase in volume. Therefore, when the size of maximum 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 17 aggregate is increased, the surface area to be wetted by water per unit volume is reduced. Consequently, the water requirement of the concrete mixes is reduced accordingly so that the water/cement ratio can be lowered, resulting in a rise in concrete strength.  However, an increase of aggregate size is also accompanied by the effect of reduced contact areas and discontinuities created by these larger sized particles. In general, for maximum aggregate sizes below 40mm, the effect of lower water requirement can offset the disadvantages brought about by discontinuities as suggested by Longman Scientific and Technical (1987)."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "In concrete compression test, normally 150mmx150mmx150mm concrete cube samples is used for testing. Why isn’t 100mmx100mmx100mm concrete cube samples used in the test instead of 150mmx150mmx150mm concrete cube samples?  Basically, the force supplied by a concrete compression machine is a definite value. For normal concrete strength application, say below 50MPa, the stress produced by a 150mmx150mmx150mm cube is sufficient for the machine to crush the concrete sample. However, if the designed concrete strength is 100MPa, under the same force (about 2,000kN) supplied by the machine, the stress under a 150mmx150mmx150mm cube is not sufficient to crush the concrete cube. Therefore, 100mmx100mmx100mm concrete cubes are used instead to increase the applied stress to crush the concrete cubes.  For normal concrete strength, the cube size of 150mmx150mmx150mm is already sufficient for the crushing strength of the machine."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What are the major problems in using pumping for concreting works?  In pumping operation, the force exerted by pumps must overcome the friction between concrete and the pumping pipes, the weight of concrete and the pressure head when placing concrete above the pumps. In fact, as only water is pumpable, it is the water in the concrete that transfers the pressure.  The main problems associated with pumping are the effect of segregation and bleeding. To rectify these adverse effects, the proportion of cement is increased to enhance the cohesion in order to reduce segregation and bleeding. On the other hand, a proper selection of aggregate grading helps to improve the pumpability of concrete."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Is it desirable to use concrete of very high strength i.e. exceeding 60MPa? What are the potential problems associated with such high strength concrete?  To increase the strength of concrete, say from 40MPa to 80MPa, it definitely helps in improving the structural performance of the structure by producing a denser, more durable and higher load capacity concrete. The size of concrete members can be significantly reduced resulting in substantial cost savings. However, an increase of concrete strength is also accompanied by the occurrence of thermal cracking. With an increase in concrete strength, the cement content is increased and this leads to higher thermal strains. Consequently, additional reinforcement has to be introduced to control these additional cracks caused by the increase in concrete strength. Moreover, the ductility of concrete decreases with an increase in concrete strength. Attention should be paid during the design of high strength concrete to increase the ductility of concrete. In addition, fire resistance of 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 18 high strength concrete is found to be less than normal strength concrete as suggested by Odd E. Gjorv (1994).  Though the tensile strength of high strength concrete is higher than that of normal concrete, the rate of increase of tensile strength is not proportional to the increase of compressive strength. For normal concrete, tensile strength is about one-tenth of compressive strength. However, for high strength concrete, it may only drop to 5% of compressive strength.  Moreover, owing to a low aggregate content of high strength concrete, creep and shrinkage increases."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What are the disadvantages of curing by ponding and polythene sheets?  The purpose of curing is to reduce the rate of heat loss of freshly placed concrete to the atmosphere and to minimize the temperature gradient across concrete cross section. Moreover, curing serves to reduce of the loss water from freshly placed concrete to the atmosphere.  Ponding: This method of thermal curing is readily affected by weather condition (cold wind). Moreover, a large amount of water used has to be disposed off the construction sites after curing.  Polythene sheet: This method of curing is based on the principle that there is no flow of air over the concrete surface and thereby no evaporation can take place on top of the freshly concreted surface by provision of polythene sheets. However, it suffers from the demerit that polythene sheets can be easily blown off in windy condition and the performance of curing would be affected. Moreover, for water lost due to self-desiccation, this method cannot replenish these losses."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Comparing the rate of “Formwork exceeding 300mm wide, horizontal or at any inclination up to and including 5o to the horizontal” with the rate of “Formwork exceeding 300mm wide, at any inclination more than 85o up to and including 90o to the horizontal”, which one is higher?  The item “Formwork exceeding 300mm wide, at any inclination more than 85o up to and including 90o to the horizontal” refers to formwork formed vertically and when compared with formwork erected in horizontal plane, the amount of falsework required is smaller.  The item “Formwork exceeding 300mm wide, horizontal or at any inclination up to and including 5o to the horizontal” refers to formwork to be erected in horizontal position and in general it requires much falsework to support this type of formwork. Therefore, the rate for this item is higher than the one mentioned in the above paragraph."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "If concrete compression test fails, should Schmidt hammer test be adopted as an alternative test to prove the concrete strength?  The Scmidt hammer test is based on the elastic rebound of hammer which presses on concrete surface and it measures the surface hardness of concrete. Since the test is very sensitive to the presence of aggregates and voids at the concrete surface, it is necessary to take more than 10 readings over the area of test. However, it should be noted that Schmidt 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 19 hammer test measures surface hardness only but not the strength of concrete. Therefore, it may not be considered a good substitute for concrete compression test."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is the indication of shear slump and collapse slump in slump tests?  There are three types of slump that may occur in slumps test, namely, true slump, shear slump and collapse slump.  True slump refers to general drop of the concrete mass evenly all around without disintegration.  Shear slump implies that the concrete mix is deficient in cohesion. Consequently, it may undergo segregation and bleeding and thus is undesirable for durability of concrete.  Collapse slump indicates that concrete mix is too wet ad the mix is deemed to be harsh and lean."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "In erection of falsework, for a rectangular panel inside a falsework should it be braced along the two diagonals?  When a rectangular panel is subject to an eccentric load or a lateral load, it tends to deform into a parallelogram with one diagonal shortening and the other elongating. Theoretically, it is sufficient to brace along one of the diagonals (the one in tension). If one diagonal is only allowed to brace inside the rectangular panel, it should be not braced in the diagonal in compression because under severe lateral loading the diagonal may buckle leading to failure of structure.  However, in actual situation lateral loads may come from both sides of the panel and hence it should be braced in both diagonals."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "In carrying out compression test for concrete, should test cubes or test cylinders be adopted?  Basically, the results of compression test carried out by using cubes are higher than that by cylinders. In compression test, the failure mode is in the form of tensile splitting induced by uniaxial compression. However, since the concrete samples tend to expand laterally under compression, the friction developed at the concrete-machine interface generates forces which apparently increase the compressive strength of concrete. However, when the ratio of height to width of sample increases, the effect of shear on compressive strength becomes smaller. This explains why the results of compression test by cylinders are lower than that of cubes. Reference is made to Longman Scientific and Technical (1987)."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is the function of rebate in a typical construction joint?  Construction joints are created on sites to facilitate the construction process. However, if improperly constructed, the completed construction joints will leave an uneven scar on the concrete surface and affect significantly its appearance. To avoid this, a rebate is formed during the first pour of one side of construction joint. After the other pour is concreted, it will hide the uneven joint inside the rebate.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 20 Fig. 2.1 A rebate."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "If a contractor proposes to increase concrete cover beyond contractual specification (i.e. 40mm to 70mm), shall engineers accept the proposal?  In contractual aspect, based on the requirement of General Specification of Civil Engineering Works (1992 Edition), the tolerance of concrete cover is between +5mm and –5mm and engineers should not accept sub-standard work because they do not possess the authority to change the acceptance criteria. In case engineers consider contractor’s proposal acceptable in technical point of view, consent has to be sought from the employer regarding the changes in acceptance criteria.  From technical point of view, the effect on cracking due to an increase in concrete cover should be considered. In general, there are three main parameters which govern crack width, namely tensile strain at the point considered, the distance of longitudinal bar to the concerned point and the depth of tension zone.  For the second factor, i.e. proximity of longitudinal bars to point of section, the closer a bar is to this point, the smaller is the crack width. Therefore, closely spaced bars with smaller cover will give narrower cracks than widely spaced bars with larger cover. Therefore, with an increase of concrete cover, the crack width will increase which is undesirable."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Can grout replace concrete in normal structure?  The mixture of cement and water alone cannot replace concrete (Longman Scientific and Technical (1987)) because:  (i) Shrinkage of grout is several times that of concrete with the same mass. (ii) The effect of creep of grout is far more than that of concrete. (iii) Heat of hydration of cement with water is more than normal concrete and this leads to the problem of severe cracking."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Which type of bar reinforcement is more corrosion resistant, epoxy-coated bars, stainless steel bars or galvanized bars?  Based on the experiment conducted by the Building Research Establishment, it was shown 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 21 that the corrosion resistance of galvanized steel was the worst among the three types of bar reinforcement. For galvanized steel bars, corrosion started to occur when a certain chloride content in concrete (i.e. 0.4% by cement weight) was exceeded. However, for epoxy-coated bars, they extended the time taken for cracking to occur when compared with galvanized steel bars.  The best corrosion resistant reinforcement among all is stainless steel. In particular, austenitic stainless steel stayed uncorroded even there was chloride contamination in concrete in the experiment. Reference is made to K. W. J. Treadaway (1988)."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Can a concrete structure be completely free of expansion joints and contraction joints?  Consider that the concrete structure is not subject to the problem of differential settlement.  For contraction joints, it may be possible to design a concrete structure without any contraction joints. By using sufficient steel reinforcement to spread evenly the crack width over the span length of the structure, it may achieve the requirement of minimum crack width and cause no adverse impact to the aesthetics of the structure. However, it follows that the amount of reinforcement required is higher than that when with sufficient contraction joints.  For expansion joints, the consequence of not providing such joints may be difficult to cater for. For example, a concrete structure has the coefficient of thermal expansion of 9x10-6 /oC and a Young’s modulus of 34.5kN/mm2. With an increase of temperature of 20oC and it is restricted to free expansion, then the structure is subject to an axial stress of 6.21MPa. If the structure is very slender (e.g. concrete carriageway), buckling may occur. Therefore, the structure has to be designed to take up these thermal stresses if expansion joints are not provided. However, for water retaining structures, most of them are not affected by weather conditions because they are insulated from the water they contain internally and soil backfill that surround them. Therefore, it is expected that a smaller amount of thermal movement will occur when compared with normal exposed concrete structure. Consequently, expansion joints may be omitted in this case with the view that the compressive stress induced by thermal expansion toughens the structure to limit the development of tensile stress."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "Does the presence of rust have adverse impact to the bond performance of bar reinforcement?  In fact, the presence of rust in bars may not have adverse impact to the bond performance and it depends on the types of bar reinforcement under consideration.  For plain round bars, the rust on bars improves the bond performance by the formation of rough surfaces which increases the friction between steel and concrete.  However, for deformed bars, the same theory cannot apply. The presence of rust impairs the bond strength because corrosion occurs at the raised ribs and subsequently fills the gap between ribs, thus evening out the original deformed shape. In essence, the bond between concrete and deformed bars originates from the mechanical lock between the raised ribs and concrete. On the contrary, the bond between concrete and plain round bars derives 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 22 from the adhesion and interface friction. With such differences in mechanism in bonding, the behaviour of bond between deformed bars and plain round bars in the presence of rust varies. Reference is made to CIRIA Report 147."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "General Specification for Civil Engineering Works (1992 Edition) Clause 15.09 specifies that tying wires for reinforcement adjacent to and above Class F4 and F5 finishes should be stainless steel wires. Why?  If plain steel tying wires are used for reinforcement adjacent to Class F4 and F5 finishes, it poses the problem of rust staining which may impair the appearance of exposed concrete surfaces. The rate of corrosion of plain steel tying wires is similar to normal steel reinforcement. However, for tying wires with very small diameter, upon long exposure it stands a high chance of rusting completely and these rust will stain the formwork and significantly affect the concrete finish. Therefore, stainless steel tying wires are specified for locations in the vicinity of high quality of finishes to avoid rust staining by corroded typing wires.  Note: Tying wires are wires used for fixing and connecting steel reinforcement bars."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "For long slender structures like beams, propping is required after removal of formwork. Why?  After concreting, the time at which striking of formworks should not be too long, otherwise it would affect the colour of concreted structures. For long span concrete structures, when they have attained sufficient strength to support their self-weight, creep deflection may occur in these structures if propping is not provided after the removal of formwork. Therefore, re-propping is carried out after removing formwork and these props should not be allowed to stand too long because creep loads may overstress them.  Note: Propping refers to provision of falsework to support slabs and beams during their gain in concrete strength after concreting."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is the difference in application between open stirrups and closed stirrups in concrete beams?  Open stirrups are provided principally to resist shear forces in concrete beams and they are applied in locations in which the effect of torsion is insignificant. U-shaped stirrups are placed in the tension side of concrete beams in which shear cracks would occur. However, when concrete beams are designed to resist a substantial amount of torsion, closed stirrups should be used instead."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "For column reinforcements, why is helical reinforcement sometimes designed instead of normal links?  The use of links for column design in Britain is very popular. However, in U.S.A. engineers tend to use helical reinforcement instead of normal links because helical reinforcement has the potential advantage of protecting columns/piles against seismic loads. Moreover, when the columns reach the failure state, the concrete outside hoops cracks and falls off firstly, followed by the eventual failure of the whole columns. The peeling off of concrete outside helical reinforcement provides a warning signal before the sudden failure of columns as suggested by G. P. Manning (1924). In addition, it can take up a higher working load than 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 23 normal link reinforcement.  For instance, helical reinforcement is adopted in the design of marine piles in Government piers.  Note: Helical reinforcement refers to shear reinforcement which is spiral in shapes."
  },
  {
    "chapter": "2 - Concrete Structures",
    "question": "What is the difference between epoxy grout, cement grout and cement mortar?  Epoxy grout consists of epoxy resin, epoxy hardener and sand/aggregates. In fact, there are various types of resin used in construction industry like epoxy, polyester, polyurethane etc. Though epoxy grout appears to imply the presence of cement material by its name, it does not contain any cement at all. On the other hand, epoxy hardener serves to initiate the hardening process of epoxy grout. It is commonly used for repairing hairline cracks and cavities in concrete structures and can be adopted as primer or bonding agent.  Cement grout is formed by mixing cement powder with water in which the ratio of cement of water is more or less similar to that of concrete. Setting and hardening are the important processes which affect the performance of cement grout. Moreover, the presence of excessive voids would also affect the strength, stiffness and permeability of grout. It is versatile in application of filling voids and gaps in structures.  Cement mortar is normally a mixture of cement, water and sand. They are used as bedding for concrete kerbs in roadwork."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What is the purpose of skin reinforcement for deep beams?  In BS8110, it states that secondary reinforcement should be provided for beams exceeding 750mm deep at a distance measured 2/3 depth from the tension face. Experimental works revealed that at or close to mid-depth of deep beams, the maximum width of cracks arising from flexure may be about two to three times larger than the width of the same crack at the level of surface where the crack originally forms.  The presence of crack is undesirable from aesthetic point of view. Moreover, it poses potential corrosion problems to reinforcement of deep beams. To safeguard against these crack formation, skin reinforcement is designed on the sides of deep beams to limit the formation of flexural crack widths. Though the principal function of skin reinforcement is to control crack width, it may be employed for providing bending resistance of the section.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 24"
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What is the function of waterstops in joints of box culverts and drainage channels?  The principal function of waterstops is to prevent liquids (e.g. water), water-borne materials and solids to pass through concrete joints. In essence, it aims at providing watertightness to the drainage channel.  Besides, waterstops in drainage channels or box culverts can also serve two other purposes: (i) to avoid water contacting joints’ dowel bars and causing corrosion. (ii) to avoid water seeping in from the underside of drainage channels or box culverts, thereby washing in soil particles and causing voids underneath these structures and finally leading to their failure. To serve the second purpose, obviously only one waterstop is required at any depth location.  To serve the first purpose, a waterstop has to be installed on top of dowel bars to prevent water from drainage channels from leaking through. On the other hand, a waterstop has to be provided below dowel bars to avoid underground water from surging upwards.  In fact, the other way out to serve the first purpose is by using corrosion resistant bars."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What are the differences in applications between pipe culverts and box culverts?  Basically, a culvert means a covered hydraulic structure which conveys fluid. Therefore in a broad sense, pipe culverts in a small scale represent normal pipes like precast concrete pipes.  In terms of hydraulic performance, circular section is the best geometrical sections among all. Therefore, for relative small discharge, precast concrete pipes and ductile iron pipes are normally used which are circular in shape. But for applications of very large flow, precast concrete pipes and ductile iron pipes may not be available in current market. In this connection, cast-in-situ construction has to be employed. It is beyond doubt that the fabrication of formwork for circular shape is difficult when compared with normal box culvert structures. However, circular shape is the most hydraulic efficient structure which means for a given discharge, the area of flow is minimum. Therefore, it helps to save the cost of extra linings required for the choice of box culverts.  However, box culverts do possess some advantages. For example, they can cope with large flow situation where headroom is limited because the height of box culverts can be reduced while the size of pipe culverts is fixed. Secondly, for some difficult site conditions, e.g. excavation of structure in rock, for the same equivalent cross-sectional area, the width of box culverts can be designed to be smaller than that of pipe culverts and this enhances smaller amount of excavation and backfilling.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 25 Fig. 3.1 Small spatial requirement of box culver than pipes."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What are the limitations of Rational Method in calculating runoff?  Computation of runoff is a complicated matter which depends on many factors like the ground permeability, rainfall duration, rainfall pattern, catchment area characteristics etc. Basically, Rational Method is a means to find out the maximum discharge suitable for design purpose. In this method, it is assumed that the rainfall duration is the same as the time of concentration and the return period of rainfall intensity is the same as the peak runoff. Time of concentration refers to the time required for the most remote location of stormwater inside the catchment to flow to the outlet. When the time of concentration is equal to the rainfall period, the maximum discharge occurs and rainfall collected inside the catchment comes to the same outlet point.  Rational Method provides the peak discharge only and it cannot produce a hydrograph. If a more detailed pattern of runoff is required, unit hydrograph or other methods have to be used. The accuracy of rational method depends very much on our correct selection of runoff coefficient and delineation of catchment area.  Rational Method is a rather conservative method. One of the basic assumptions of the rational formula is that the rainfall intensity must be constant for an interval at least equal to the time of concentration. For long duration of rainfall, this assumption may not hold true. Moreover, the runoff coefficient in Rational Method is difficult to be determined accurately and it depends on many factors like moisture condition of soils, rainfall intensity and duration, degree of soil compaction, vegetation etc. In addition, In Rational Method the runoff coefficient is independent of rainfall intensity and this does not reflect the actual situation.  4.Why are some manhole covers made of cast iron while some are made of ductile iron?  Traditionally, manholes covers are made of cast iron. However, in the viewpoint of pipe maintenance, frequent opening of manhole covers has to be carried out. Therefore, it poses potential safety hazard to the workers during the lifting-up process of manhole covers because cast iron manhole covers are very heavy to normal workers. Consequently, research has been conducted and ductile iron is considered as a better choice than cast iron because it can resist the same traffic loads with lower self-weight. Moreover, as ductile iron is less brittle than cast iron, the traditional cast iron manhole covers are more susceptible to damage and thus requires higher maintenance cost.  However, ductile iron manhole covers do suffer from some demerits. For instance, owing 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 26 to their relative low self-weight, vehicles passing over these manhole covers would lead to the movement of covers and generate unpleasant noises. To solve this problem, instead of increasing the self-weight of ductile iron manhole covers which similarly causes safety problems to workers during regular maintenance, the covers can be designed to be attached to the manhole frames which hold them in firm position."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "Why is it preferable to design stormwater drains to match soffit?  Stormwater drains collect stormwater in their corresponding catchment areas during rainstorm and convey the collected water through outlets to the sea. Therefore, in considering the hydraulic design of stormwater drains, other than normal drainage pipe capacity to be taken into consideration, one should check the backwater effect due to tidal condition at outlets if the drains are located quite close to the downstream end of outlets.  Stormwater drains are normally designed to match soffit to avoid surcharging by backwater effect or when the downstream pipes are running full. Normally pipe size increases from upstream to downstream. For the case of matching drain invert, when outlet pipes are fully surcharged by tidal effect of the sea or when the downstream pipes are fully filled with stormwater, pipe sections immediately upstream of the outlet are also surcharged too. However, for the case of matching pipe soffit, the immediate upstream sections of outlet pipes are not totally surcharged even though downstream pipes are running full. However, it is not always practical to maintain soffit for all pipelines because it requires sufficient drop to achieve this.  Moreover, the flow of stormwater is mainly by gravity in the design of stormwater drains. In case the drains are designed to match invert, then it stands a high probability that the flow in the upstream smaller pipes has to be discharged against a head.  Note: Matching soffit means that all pipelines are aligned continuously with respect to the pipelines’ crown level.   Fig. 3.2 Match soffit VS match invert."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What is the application of inverted siphons? What are the disadvantages of using 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 27 inverted siphons?  Inverted siphons are designed at locations in which a sewer system is blocked by underground utilities or stormwater drains. They are sometimes called depressed sewers because it is claimed that there is no actual siphon action. They connect the upstream and downstream sewers with U-shaped vertical alignment such that they are always running full.  The drawbacks of inverted siphons are: (i) They induce additional head loss to the sewer system which is undesirable in hydraulic performance; (ii) U-shaped siphons create sediment accumulation problem and previous experience showed that inverted siphons were easily blocked due to siltation; (iii)  Maintenance of invert siphons is difficult due to its inaccessibility."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What is the mechanism of cavitation in pipes and drains?  Cavitation refers to the formation of air bubbles in fluid in low-pressure condition which is lower than the saturation pressure. It is a potentially damaging condition in which the fluid in pipes or sewers is at high velocities. By Bernoulli’s Equation, at high flow velocities, the pressure head of fluid is reduced accordingly. As the fluid pressure is less than saturation pressure, dissolved gases are released from the fluid and these air bubbles will suddenly collapse when the flow enters into a region of higher pressure. This produces a high dynamic pressure which causes damage to the pipelines due to its high frequency."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "When a drainage system (i.e. u-channels with catchpits) is connected to a main drainage channel, a segment of short pipe is used. What is the reason of such arrangement?  There are three scenarios of such connection arrangement: (a) a new drainage system is connected to an existing drainage channel (b) an existing drainage system is connected to a new drainage channel (c) a new drainage system is connected to a new drainage channel.  For all scenarios, what engineers consider is the total amount of differential settlement or lateral movement to be encountered between the drainage system and main drainage channel. For scenario (b) and (c), it is very likely that substantial differential settlement will occur and this will cause damage to the connecting concrete pipes. Therefore a segment of short pipes are designed so that they serve to provide flexibility to the pipes in case of uneven settlement occurring between drainage system and main drainage channels.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 28 Fig. 3.3 Short pipe."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What are the functions of bedding under stormwater drains?  Bedding, which are normally made of granular materials or concrete, serves four main functions as suggested by O. C. Young and J. J. Trott:  (i) To enhance a uniform support under pipes in order to reduce the bending moment longitudinally; (ii) To increase the load-supporting strength of the pipes; (iii) For pipes with spigot and socket joints, it enables pipes to be supported along pipe lengths instead of pipe sockets. Otherwise, uneven stress may be induced and it may damage the pipes; (iv) To provide a platform for achieving correct alignment and level during and after construction."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "In designing sewer pipes, why are vitrified clay pipes commonly used for pipe size less than 600mm while precast concrete pipes with PVC lining is used for pipe size exceeding 600mm?  The market price of vitrified clay pipes is generally less than that of precast concrete pipes with PVC lining. Therefore, for small size of pipes (pipe diameter less than 600mm) it is more economical to use vitrified clay pipes. However, vitrified clay pipes do suffer from the problem of brittleness and its effect is even severe for larger size of pipes. Moreover, it is rather time consuming to deliver clay pipes products because the majority of them are manufactured in Europe. Hence, for larger size of sewer pipes (diameter more than 600mm) it is customary to use precast concrete pipes with PVC lining."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "Nowadays, most flap valves are made of HDPE. What are the advantages of using HDPE when compared with cast iron?  (i) It has no reaction with sewage and seawater and does not suffer from the corrosion problem associated with cast iron. (ii) No protective coating is required and it is almost maintenance-free. (iii) HDPE flap valves require very low opening pressure in operation (like 5mm water level difference). For cast iron flap valves, due to its own heavy self-weight, the 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 29 required opening pressure of cast iron flap valves is higher than that of HDPE flap valves. This criterion is essential for dry weather flow conditions.  However, the pressure resistance of HDPE flap valves is not as good as cast iron flap valves. For instance, a typical 450mm wide HDPE flap valve can only withstand about 5m water column."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "What are the functions of the following features observed in a typical manhole? (i) groove near benching, (ii) R.S.J. (iii) double seal manhole cover and (iv) u-trap with rodding arm.  (i) The groove is used to facilitate the maintenance of manholes and sewer/drain pipes. Shutoff boards are erected on the grooves during maintenance operation so that water flow coming from upstream is terminated in the manhole and backwater from downstream is also blocked. In addition, the groove also facilitates water flow diversion for routine maintenance operation. (ii) R.S.J. is a small-scale size of universal beams and is used for resisting the high stresses incurred by heavy traffic loads acting directly on the upper narrow projected section of manholes. (iii) Double seal terminal manhole covers are used for sealing off gases emitted inside sewer/drains and prevent them from releasing out of the manhole. (iv) U-trap with rodding arms is also used for sealing off unpleasant gas smell by the trapped u-shaped water columns. Rodding arm is normally closed with rubber rings during normal operation. However, during maintenance operation, the rubber ring is removed and rodding can be carried out through the rodding arm."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "The spacing of manholes in straight sections for different pipe sizes is stated in Stormwater Drainage Manual. How are these figures arrived at?  For pipe size < 300mm, rodding is usually adopted in which workers place about 1m long rods through the pipes to the location of blockage and manually operate the rod to clear the blockage.  For pipe size < 700mm, water-jetting is normally employed in which water is supplied from nearby fire hydrants and pressurized water jet is used for clearing blockage.  Winching method is adopted for all sizes of pipes.  For instance, for pipe size exceeding 1050mm, it is stated in Stormwater Drainage Manual that maximum intervals between manholes along straight lengths should be 120m. This is because for sizes over 1050m, the main method of pipe maintenance is by winching whose maximum length of operation is 120m. Similarly, the maximum intervals of manholes for other straight pipes are derived from their corresponding maintenance methods."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "In selection of dams in drainage channels, what are the advantages of using rubber dams instead of steel-gate dams?  The advantages of rubber dams are as follows: (i) Since rubber is flexible in nature it is capable of performing deflation even in the presence of dirt and sedimentation on the downstream side. However, for rigid 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 30 steel-gate dams, it may not be possible to open when there is excessive sediment. (ii) Since the foundation of rubber dams is comparatively lighter than that of steel-gate dams, it saves both construction cost and time. (iii) Rubber dams can be designed with longer spans without piers while steel-gate dams require intermediate piers for long spans."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "Should air test or water tests be selected to test the leakage of constructed gravity pipelines?  For gravity pipes, air tests or water tests are carried out after completion of laying and jointing of the pipes. These tests are conducted to check the watertightness of joints and to ensure the pipelines are free from damage where leakage may occur.  Air test has the advantage that the test itself is simple and faster to be carried out. It does not require the disposal of significant quantities of water used in the test which is a mandatory requirement for water test. However, in case leakage exists in the constructed segment of gravity pipelines, the position of leakage can hardly be located in air test. Moreover, the rate of water leakage cannot be determined from air tests. In addition, air test is readily affected by atmospheric condition because air has a relatively high coefficient of thermal expansion. The test is also influenced by the moisture condition of the test pipelines because it affects the passage of air through the pipelines.  For water test, though it is comparatively slow, it can detect the location of water leakage. However, the leakage rate results from water test may not truly reflect its actual leakage because pipeline materials like concrete and clay are porous and would absorb water during the test."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "In designing of access ramps for drainage channels, why should the direction of access ramps be sloping down towards downstream?  In the design of access ramps, the direction is normally specified to be sloping down towards downstream so as to avoid the occurrence of over-shooting of flowing water for supercritical flow in case of aligning the ramps in the reverse direction of channel flow.  Note: Access ramps refer to ramps used for maintenance vehicles during routine maintenance of channels."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "When branch pipelines are connected to main pipelines, sometimes Y-junctions or fitting branched pipelines to main pipelines by formation of holes in main pipelines are used. Which one is a better choice?  By using standard precast units of Y-junction branch pipelines, it is beyond doubt that joints between branched pipelines and main pipelines are properly formed and the quality of joints is relatively less dependent on workmanship. However, it suffers from the problem that with fixed precast units of Y-junctions, sometimes it may be difficult for contractors to determine the precise orientation of specific angles of Y-junctions with respect to gullies. (e.g. gullies are connected through side branches to carrier drains)  By forming elliptical holes in main pipelines and fitting the side branches into them with cement mortar, the quality of pipe joints is highly dependent on workmanship. It is commonly found that in subsequent CCTV inspections side branches are projected inside 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 31 main pipes. This is undesirable because the projected side branches reduce the cross sectional area of main pipes locally and affect their hydraulic performance. Moreover, the projected side pipes may trap rubbish and dirt in the vicinity. On the other hand, cement mortar may not be properly applied at connection joints because these areas are hidden from view and are difficult to be inspected by engineers. Therefore, in selecting between the two available methods, engineers should make their own judgments based on the above considerations.   Fig. 3.4 Y-junction in drainage pipes."
  },
  {
    "chapter": "3 - Drainage Works",
    "question": "Rational Method should not be used for large catchments in estimating peak runoff. Is it true?  Rational Method is suitable for small catchments only because the time of concentration of small catchments is small. In Rational Method the peak runoff is calculated based on the assumption that the time of concentration is equal to the rainfall duration. For small catchments, this assumption may hold true in most circumstances. One of the assumptions of Rational Method is that rainfall intensity over the entire catchment remains constant during the storm duration. However, in case of a large catchment it stands a high probability that rainfall intensity varies in various part of the large catchment. In addition, for long duration of rainfall, it is rare that the rainfall intensity remains constant over the entire rainstorm and a shorter duration but a more intense rainfall could produce a higher peak runoff. Moreover, a reduction of peak runoff is also brought about by the temporary storage of stormwater like channels within the catchment.  In actual condition, the runoff rate within the catchment varies from place to place because of different soil properties and past conditions. As suggested by Bureau of Public Roads (1965), sometimes the peak discharge occurs before all of the drainage area is contributing. For instance, when a significant portion of drainage area within the catchment has very small time of concentration so that a higher rainfall intensity can be used for this portion, the runoff coming solely from this portion is higher than that of the whole catchment in which a lower rainfall intensity is adopted because the remaining part of the catchment has comparatively large time of concentration. Therefore, this results in incorrect estimation of peak runoff of large catchments if Rational Method is adopted."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "What is the purpose of carrying out water absorption test for precast concrete pipes?  Cement will mix with more water than is required to eventually combine during hydration 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 32 of cement paste. As such, some voids will be left behind after the hydration process which affects the strength and durability of concrete. With the presence of air voids in concrete, it is vulnerable to penetration and attack by aggressive chemicals. Good quality concrete is characterized by having minimal voids left by excess water and therefore, water absorption test for precast concrete pipes is adopted for checking the quality of concrete in terms of density and imperviousness. 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 33"
  },
  {
    "chapter": "4 - Earthworks",
    "question": "In soil compaction test, if a test result exceeds 100%, should engineers accept the result?  Soil compaction is the process of increasing the soil density by reducing the volume of air within the soil mass.  Soil compaction depends mainly on the degree of compaction and the amount of water present for lubrication. Normally 2.5kg rammers and 4.5kg rammers are available for compaction in laboratories and the maximum dry densities produced by these rammers cover the range of dry density obtained by in-situ compaction plant.  Regarding the second factor of water content, it affects the compaction in the following ways. In low water content, the soils are difficult to be compacted. When water content is increased gradually, water will lubricate the soils and this facilitates the compaction operation. However, at high water content, as an increasing proportion of soils is occupied by water, the dry density decreases with an increase in water content.  For soil compaction tests, the dry density obtained from compaction carried out in-situ by vibrating roller/vibrating plate is compared with the maximum dry density conducted in laboratories using 2.5kg rammer of compaction with similar soils. In essence, the in-situ compaction is compared with the compacting effort of using 2.5kg (or 4.5kg) rammer in laboratories. In case the compaction test results indicate values exceeding 100%, it only means that the in-situ compaction is more than that being carried out in laboratories which is treated as the basic criterion for satisfactory degree of soil compaction. Therefore, the soil results are acceptable in case compaction test results are over 100%. However, excessive compaction poses a risk of fracturing granular soils resulting in the reduction of soil strength parameters."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "What are the different applications of draglines, backhoes and shovels?  An excavator is defined as a power-operated digging machine and it includes different types like shovels, draglines, clamshells, backhoes, etc.  A dragline possesses a long jib for digging and dumping and it is used for digging from grade line to great depths below ground. Its characteristic is that it does not possess positive digging action and lateral control of normal excavators. A dragline is normally deployed for bulk excavation.  A backhoe is designed primarily for excavation below ground and it is especially employed for trench excavation works. It digs by forcing the bucket into soils and pulling it towards the machine and it possesses the positive digging action and accurate lateral control.  A shovel is a machine that acts like a man’s digging action with a hand shovel and hence it is called a shovel. It digs by putting the bucket at the toe of excavation and pulling it up. Though a shovel has limited ability to dig below ground level, it is very efficient in digging above ground like digging an embankment."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "For compaction of free-draining sands or gravels, what is the optimum moisture 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 34 content to achieve maximum density?  The compaction curve of sandy materials is totally different from that of clayey materials. For sands or gravels, there are two situations of maximum density, namely the completely dry condition and the complete water saturation. For moisture content of sands and gravels between these two states, the dry density obtained is lower than that obtained in the above-mentioned states. The presence of capillary forces account for the difficulty of compaction sand at water contents between virtually dry and saturated state. They are formed in partially filled water void between soil particles and perform as elastic ties cementing soil particles together. Reference is made to Lars Forssblad (1981).  The compaction curve for clay is suitable for the majority of soil types except sands and gravels because a small amount of clay in soils is sufficient to make the soils impermeable."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "Is it worthwhile to carry out tests on particle density of soil particles for geotechnical design?  Particle density of soils is defined by the ratio of soil particle mass and soil particle volume. Depending on soil types, the range of variation of soil particle density varies not significantly, i.e. by 4%. Therefore, it may not be worthwhile to order laboratory tests and incur additional expenditure just to determine the particles density by recognizing that the variation of particles density is not significant."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "In determining the effective stress parameters of a soil sample, which test is preferable, consolidated undrained test or consolidated drained test?  The effective stress parameters of a soil sample can be obtained from both consolidated undrained test and consolidated drained test. However, consolidated undrained test is normally selected because of the following reasons:  (i) Time taken for consolidated undrained test is shorter than that of consolidated drained test. It is because consolidated drained test requires the full dissipation of excess pore water pressure of the soil during testing and it takes long time when soils of low permeability are tested. (ii) Useful information can be obtained from the stress path of consolidated undrained test. (iii)Failure occurs in lower stress level when compared with consolidated drained test."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "In conducting triaxial test to determine shear strengths for soil samples, what consolidation pressures should be specified?  It appears that the selection of consolidation pressure is independent of in-situ soil stress theoretically. However, this may not be correct because the actual shear strength envelopes for soils are non-linear over a wide range of stresses. Therefore, consolidation pressure corresponding to the range of stresses relevant to site condition should be adopted."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "What is the relation of bearing pressure on soil nail head to the ratio La/Lb, where La is the length of soil nail before the potential slip circle while Lb is the length of soil nail beyond the potential slip circle?  The unstable soil mass before the potential circular slip is resisted by two components: soil 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 35 nail head bearing pressure and friction of soil nail in the unstable soil mass. Therefore, the longer is the length of soil nail before potential slip circle La, the higher is the proportion of forces being resisted by frictional forces and hence the smaller amount is to be resisted by soil nail head. Hence, the smaller the ratio La/Lb, the greater is the resistance provided by soil nail head.  Fig. 4.1 La & Lb in slopes."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "Soil nails are mainly designed for stabilization of major slips. How should designer cater for the stability of minor slips?  There are some methods to treat minor slips: (i) Adoption of smaller diameter size bars at closer spacing; (ii) Installation of tie beams at the same horizontal levels; (iii) Provision of steel wire meshes in-between soil nails; and (iv)  Provision of short soil nails in combination of long soil nails."
  },
  {
    "chapter": "4 - Earthworks",
    "question": "What are the main reasons for conducting pull-out tests for soil nails?  There are mainly four reasons for this test:  (i) To check and verify the bond strength between soil and grout adopted during the design of soil nails. This is the main objective of conducting soil nail pull-out test. (ii) To determine the bond strength between soil and grout for future design purpose. However, if this target is to be achieved, the test nails should be loaded to determine the ultimate soil/grout bond with a upper limit of 80% of ultimate tensile strength of steel bars. (iii) To check if there is any slippage or creep occurrence. (iv) To check the elastic and plastic deformations of test nails. This is observed during the repeated loading and unloading cycles of soil nails.  Note: Pull-out tests are carried out by applying specified forces in an attempt to pull out the constructed soil nails."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Are there any differences in the methods of compaction between clayey soil material and sandy material?  As suggested by Lars Forssblad (1981), the three main actions of compaction are static pressure, impact force and vibration. Different compactors contain one or more modes of these actions. For example, vibratory tampers perform mainly by the principle of impact 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 36 while vibratory rollers work with principle of static pressure and vibration.  For sandy soils, vibration is adequate for normal compaction because the action of vibration sets the soil particles in motion and friction forces between soil particles are virtually demolished. During this vibration motion, the soil particles rearrange themselves to develop a dense state.  For normal soils, it is necessary to combine the action of vibration together with static pressure to breakdown the cohesion forces between soil particles in order to allow for better compaction. The static pressure of vibratory machines is adopted to exert a shearing force to eliminate the cohesion in clayey soils. 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 37"
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Why is sulphate-resisting cement not used in marine concrete?  The main components of Portland cement are tricalcium silicate, dicalcium silicate, tricalcium aluminate and tetracalcium aluminoferrite. In sulphate-resisting cement, it contains a low amount of tricalcium aluminate in order to avoid sulphate attack. Otherwise, tricalcium aluminate would react with sulphates to form calcium sulphoaluminate and gypsum that cause expansion and crack the concrete structure.  However, for marine concrete sulphate-resisting cement should not be used because tricalcium aluminate has high affinity for chloride ions. This is based on the possible reaction of chloride ions and tricalcium aluminate to form calcium chloroaluminate hydrate as suggested by P. Kumar Mehta (1991) and the reduction of which may increase the rate of chloride attack to the concrete marine structure and result in faster corrosion of steel reinforcement in marine structures."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Shall a layer of wearing course or additional thickness be designed on the surface of piers?  In the design of piers, consideration should be given to the effect of wearing action caused by passengers, other traffics and even sometimes vehicles. In maritime environment, the durability and integrity of concrete is detrimental to the servicing life of piers because it acts an essential barrier to chloride attack. However, in view of these gradual wear and tear generated by the loading traffic, some forms of surface protection should be provided on top of pier surface like wearing course or additional increase in concrete cover.  3.What is the difference in application of surface-protecting fenders and energy-absorbing fenders?  Surface-protecting fenders are fenders that induce high reaction forces to berthing structures for the energy absorbed while energy-absorbing fenders are fenders which transmit low impact to berthing structures for the energy absorbed (Carl A. Thoresen (1988)). In fact, the principal function of fenders is to absorb the berthing energy and transmit a force to the structures without damaging them. Therefore, in open berth structures, it is desirable to use energy-absorbing fenders to reduce the loads acting on the relatively flexible structures. On the other hand, for solid berth structures the usage of surface-protecting fenders is adequate because they are capable of taking up large berthing loads."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Should dolphins be designed in a rigid manner, i.e. resting on several raking piles?  In designing dolphins, they are normally supported on a system of three to four raking piles. This in essence is a rigid structure and exhibits little flexibility e.g. movement against impact and berthing loads by vessels. In fact, this kind of design may not be desirable in terms of maintenance because the dolphins are readily susceptible to damage by high berthing vessels. To rectify this situation, some energy absorption devices like rubber/plastic fenders have to be installed to reduce the impact load deriving from its own deflection. On the other hand, by designing dolphins as flexible structures capable for allowing slight deflection, it helps to reduce the large forces generated during berthing of 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 38 vessels. In this connection, one way of designing dolphins as flexible structures is by provision of a single pile only.  Note: For a rigid structure, it takes up external loads without undergoing excessive deformations."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "In connecting fenders to pier structures, should single lock nuts or double lock nuts be used?  In many pier structures the connection of fenders to piers is achieved by using single lock nuts. However, they do not perform well because some timber fenders loosen more easily when subject to vibrating loads due to berthing, wave and tidal actions. To solve this problem, double lock nuts should be adopted as they prove to function satisfactory in other structural elements which are subject to frequent vibration loads.  Note: Double lock nuts mean two nuts are adopted in a single bolt connection between fenders and marine structures."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "What is the design level of landings in piers?  Landings are designed as resting place for passengers during berthing and deberthing of vessels. In general, landings are provided near mean high and mean low water levels to facilitate embarking and disembarking of passengers (BS6349: Part 2: 1988). Therefore, the level of landing steps should be different from place to place because of different mean high and mean low water levels in different locations."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "What are the pros and cons of using timber fenders, plastic fenders and rubber fenders?  Timber fenders: They are low in strength and are subject to rotting and marine borer attack. Moreover, they have low energy absorption capacity and the berthing reaction depends on the point of contact. The contact pressure between fender and vessels are high. They are considered to be environmentally unfriendly because they consume tropical hardwoods in their production.  Plastic fenders: Their strength is similar to that of timber fenders but they have relatively high abrasive resistance. They are resistant to chemical and biological attack. Their energy absorption capacities are moderate and the berthing reactions are also dependent on the point of contact. The reaction is lower when compared with timber fenders for a given energy absorption. They are considered to be environmental friendly because they are manufactured from recycled material.  Rubber fenders: They possess high abrasive resistance and are also resistant to most biological and chemical attacks. They have moderate to high energy absorption capacity and the energy absorption performance is independent of the point of contact. Similar to plastic fenders, they are also environmental friendly products."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Why are most marine piles circular in cross section?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 39 For marine piles, there are several options available for selection, namely H-piles, circular pipes and box piles.  However, only circular piles and box piles are suitable for marine application because of the following two reasons suggested by G. M. Cornfield (1968): (i) Circular piles and box piles possess high column buckling strength. For marine structures like jetties, piles are well above seabed level and therefore the column buckling effect is significant when compared with other structures. Therefore, it is essential to use pile sections which have relatively high buckling strength in piers. (ii) Circular piles and box piles display high energy absorbing capability. For marine structures like dolphins and fenders, which require substantial amount of berthing energy to be absorbed, these piles sections are inevitably good choices.  In marine structures, it appears that circular sections prevail over the box sections. The main reason is that the range of section available for selection of circular piles is more than that of box piles."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "For marine pile type of steel tubular piles with reinforced concrete infill, minimum toe level is often specified in contract drawings. What is its purpose?  The purpose of minimum toe level is two-fold:  (i) In detailed design stage, ground investigation should be conducted and the approximate level of rockhead is known. Therefore, to avoid the marine piles to be founded prematurely on boulders, minimum toe levels of marine driven piles are specified in contract. (ii) It provides sufficient length of soils for lateral and uplift resistance.  Note: Minimum toe level refers to the minimum level that a marine driven pile should be driven into seabed."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "What is the problem in traditional marine piling system of steel tubular pile with concrete infill and what are the possible remedial measures?  In the design of marine piles of steel tubular piles with concrete infill, loads from pier deck are taken up by steel tubular piles before the occurrence of corrosion of steel piles above seabed. In fact, it is assumed that steel piles above seabed level will all be corroded after a certain year. The load transfer mechanism after complete corrosion of steel pile above seabed is as follows: loads from pier deck are taken up by concrete infill above the seabed level. Below the seabed level, loads would be transferred to steel piles through frictional forces between concrete infill and steel casings.  However, substantial radial shrinkage and contraction occurs after concreting of concrete infill and this will hinder the load transfer from the concrete infill to steel piles because the bond may be ruptured by radial shrinkage. It is in doubt if frictional forces can be properly developed in this situation. To solve this problem, shear keys could be installed at regular spacing inside steel piles to ensure their rigid connection with concrete infill. Alternatively, expanding agents may be adopted in concrete mixes to ensure that there is no shrinkage after the concreting process."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Why are steel tubular marine piles often driven open-ended? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 40  In marine structures where piles are constantly subject to significant lateral and uplift forces induced by berthing operation and wave action, it is necessary to drive the piles to much greater depth. To avoid premature refusal so that insufficient soil cover may develop which is incapable of providing the required lateral and uplift resistance, tubular piles are normally driven open-ended so that they are driving to greater depths than piles with closed ends.  Fig. 5.1 Typical details of marine piles."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "For typical pile bents in marine piers, how is vertical loads related to horizontal capacity of the pile bents?  Let’s consider a pile bent with a top slab supported by two ranking piles, each inclining at an equal angle to the pier slab. In designing such a system, truss action is normally adopted to analyze the pile bent. When the reaction forces of these piles, horizontal forces (e.g. due to berthing and deberthing of vessels) and vertical forces (e.g. superimposed deck loads) are analyzed by drawing a force polygon, it is noted that lateral resistance of the pile bent is dependent on the vertical load, i.e. lateral resistance is small when vertical loads are high.  Fig. 5.2 Force polygon of pile bent. 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 41"
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "For underwater concreting, tremie pipes are normally used with the aid of hoppers. Sometimes tubes are inserted inside the hoppers. Why?  In placing concrete by tremie pipes, hoppers are connected to their top for receiving freshly placed concrete. However, air may be trapped inside the tremie pipes if there is rapid feeding of fresh concrete. To release the trapped air inside the tremie pipes, hoses (called ventilation tubes) are inserted and lowered down through the hoppers. Reference is made to Carl A. Thoresen (1988)."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Why is shallow bedrock condition unfavorable for open berth piers?  The most severe load on piers generally is the horizontal load due to berthing of large vessels. Since the widths of open berth piers are relatively small so that they provides a short lever arm to counteract the moment induced by berthing loads. Moreover, the dead load of open berth piers are normally quite light and therefore the resisting moment provided by the dead load of pier structures may not be sufficient to counteract the moment generated by berthing loads.  To aid in providing adequate resistance to the overturning moment by the berthing load, the soil resistance above bedrock contributes to stabilizing moment. For commonly adopted marine piling type, i.e. driven steel tubular piles with reinforced concrete infill, driven piles can at most be founded on top of rockhead surface. In case the rockhead level is shallow, then the little soil cover may result in insufficient lateral resistance to the berthing load."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Why are high and narrow beams not desirable in concrete piers?  Based on past experience in other countries (Carl A. Thoresen (1988)), high and narrow beams after several years of construction showed signs of serious deterioration at the bottom of the beams. However, the deterioration of pier slabs was not significant when compared with that of the deep beams. The main reason to account for this is due to the close proximity of the deep beams to the sea level. To avoid these problems, either beamless slab or wide with shallow beams are normally designed.  16.What is the mechanism of formation of soil plugs in marine driven steel piles with reinforced concrete infill?  During initial driving process, open-ended steel piles are driven through the soils at their bases. However, shaft friction will gradually develop between the steel piles and soils inside piles at some time after pile driving. The hitting action of driving hammers induces forces to the soil and later it comes to a stage when the inertial forces of inside soils, together with the internal frictional forces exceeding the bearing capacity of soils at pile toes. Consequently, the soil plug formed is brought down by the piles. Reference is made to M. J. Tomlinson (1977).  Note: A soil plug is a column of soil formed at the bottom portion of marine pile type of steel tubular piles with reinforced concrete infill."
  },
  {
    "chapter": "5 - Piers and Marine Structures",
    "question": "Should stiff or soft fenders be designed for berthing in piers?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 42 The elasticity of fenders is related to the ability to release the stored energy during berthing of vessels. However, it has no effect on the reaction force and the deflection of fender system. The amount of energy that a fender can absorb is dependent on the reaction-deflection curve and is represented by the area under the curve. The higher is the reaction force, the higher amount of energy would be absorbed by the fender provided that the resistance of ships’ hull is sufficient to withstand the force without permanent deformations. Although stiff and soft fender may have the same deflection under the same maximum reaction force acting on the berthing vessel, the amount of energy absorbed by stiff fenders is much higher than that of soft fenders. Consequently, stiff fenders should be employed for berthing purpose.  On the other hand, in mooring operations where vessels are constantly subject to wave action, it is desirable to keep the tension force on the rope to a low value. In this connection, it is recommended to use soft fenders."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the significance of direction of approaching velocities of ships during berthing operation?  One of the major effects of angle of approaching velocities of ships is its influence of the energy to be absorbed by the fender system. Consider several ships berth on the same pier at the same speed but with different angle of approach, though their kinetic energies are the same, the amount of energy absorbed by fender differs. The amount of energy absorbed by fender is:  W = 0.5mv2 (k2+r2cos2Φ)/ (k2+r2)  where W= energy absorbed by the fender   m= mass of the ship   v=velocity of the ship   k= radius of gyration of the ship   r= distance of centre of gravity of the ship to the point of contact of the fender   Φ=direction of velocity  Hence, when the direction of approaching velocity of a ship is normal to the fender system (i.e. Φ=90 ), the amount of energy absorbed is smaller when compared with that of a ship whose velocity is tangential to the shoreline. Reference is made to F. Vasco Costa (1964).  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 43"
  },
  {
    "chapter": "6 - Roadworks",
    "question": "How can unreinforced concrete pavement function without mesh reinforcement?  For concrete carriageway, it is normally classified into two types: reinforced and unreinforced concrete pavement. The reinforcement in reinforced carriageway (in the form of mesh) is used for controlling cracking. Then one may query how unreinforced pavement can control cracking without the use of mesh reinforcement. To answer this question, one should pay attention to the features of unreinforced concrete pavement. In accordance with Highways Standard Drawing No. H1109, an approximately 3mm wide groove with a depth of about one-third to one-fourth of slab thickness is designed with a regular spacing (normally 5m). The grooves are designed to be too narrow for stones to fall into when the cracks are open due to concrete contraction. The sectional area in which the groove is located is a plane of weakness and thus this groove acts a potential crack-inducing device in which any potential cracks due to shrinkage and thermal contraction may form. Consequently, the cracks are formed at the base of the groove and thus it would not cause any unpleasant visual appearance on the exposed surface of unreinforced concrete pavement. Fig. 6.1 Crack formed in unreinforced concrete pavement."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Why are concrete profile barriers designed with curved surface profiles?  Safety fencings are designed to contain vehicles in the carriageway in which they are traveling and prevent them from rebounding into the road and causing hazards. For normal fencing design, when vehicles crash into safety fencings, it will give way so as to absorb as much energy as possible, thus reducing the impact forces on the vehicles. Moreover, it serves to realign the vehicles along the carriageway when vehicles hit on them. However, for concrete profile barriers they are not designed to absorb energy during vehicle crashing, but to hold the vehicles hitting on them. In this connection, concrete profile barriers are designed with curved profiles so that vehicles can mount and go up partly on them, and yet they will not cause overturning of vehicles. Reference is made to Arthur Wignall, Peter S. Kendrick and Roy Ancil.  For shallow-angle crashing of cars, they would climb on the lower slope face of concrete profile barriers. On the other hand, when a car hits at a large angle to the barrier, the 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 44 bumper collides with the upper sloping face of concrete profile barrier and the car rides upwards. This provides the uplift of the car whose wheels move up the lower sloping face of the barrier. It is not intended to lift the car too high, otherwise it may result in rolling. Since the friction between the wheels and barriers provide extra lifting forces, it is undesirable to design rough finish on these faces. In essence, the kinetic energy of the car during collision is transformed to potential energy during its lifting up on profile barrier and finally converted back to kinetic energy when the car returns to the road.  Note: For details of concrete profile barriers, reference is made to HyD Standard Drawing No. H2101A."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Should joints of concrete kerbs be in line with the joints in concrete carriageway?  In normal practice, joints are provided in road kerbs to cater for concrete expansion and contraction. However, the location of joints in kerbs is not arbitrary and they should match with joints in concrete carriageway. Otherwise, it is very likely that cracks may form in concrete kerbs at location of pavement joints (Ministry of Transport (1955))."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Why is the slump specified in concrete carriageway comparatively low (30mm) when compared with normal concrete (75mm)?  The slump of concrete carriageway is purposely specified to be a relatively low value, i.e. 30mm. For concrete carriageway, traffic loads directly act on concrete pavement surface and therefore the surface strength is detrimental to its future performance. In freshly placed concrete, segregation (may be in the form of bleeding) occurs within the mixture of cement paste and aggregates. The degree of resistance to segregation is related to workability of concrete. If substantial segregation is allowed to take place, then the relatively porous and weak laitance layer will be formed on the carriageway surface and the aggregates will concentrate in the bottom. Hence, concrete which has insignificant bleed possesses a stronger surface layer and is more abrasion resistant. Consequently, a small slump value is specified to increase the wearing resistance of concrete and to achieve a suitable surface texture of concrete pavements.  Moreover, a low-slump concrete facilitates the use of slipforms when constructing the concrete pavement. With concrete of a low slump value, it still remains its compacted shape and is not liable to deform when the paving machines go away. However, if a high slump concrete is used instead, the pavement surface would drop and the edges may deform readily."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Can all utility detectors detect the depth of utilities?  In Hong Kong, underground utility detectors are normally divided into two types: electromagnetic detector and ground penetrating radar (GPR).  For electromagnetic detector, it can detect the signals emitted by metallic utilities themselves by passive mode. While in active mode, the detector has to pick up the signals through a transmitter and sonda connected directly to the non-metallic utility. Both the alignment and depth can be found in active mode while only alignment can be found in passive mode. The electromagnetic detector available in market can detect utilities up to depth of 3m.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 45 For ground penetrating radar, it sends radio waves into the ground and receives signals from reflections from utilities. It has the advantage of locating both the depth and alignment of utilities. More importantly, it can detect both metallic and non-metallic utilities. However, it suffers from the disadvantage that it is quite expensive and interpretation of data is not simple. Reference is made to LD, DSD (2000)."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the importance of air void content in bituminous pavements?  The air void content of bituminous materials is an important control parameter for the quality of bitumen being laid and compacted. If the air void content is too high, it allows for intrusion of air and water. Moreover, it also increases the rate of hardening of binders which produce premature embrittlement of pavements. In addition, too high a void content will also lead to differential compaction subject to traffic loads and result in formation of ruts and grooves along the wheel track.  However, a minimum amount of air void should be maintained to avoid instability during compaction process and to provide space for bitumen flow in long-term consolidation under traffic loads. A sufficient amount of air voids should be designed to make room for expansion of binder in summer and compaction by road traffic as suggested by National Association of Australian State Road Authorities (1968), otherwise bleeding and loss of stability may occur and the pavement will deform readily under severe loads."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "In concrete pavement, why is the requirement of 95% by mass of quartz grains are specified in contract?  In General Specification of Civil Engineering Works (1992 Edition), in Clause 10.09 it states “Fine aggregate for concrete shall be natural river-deposited sand consisting of at least 95% by mass of quartz grains”. The aim of such specification is to control the quality of river sand. As quartz is a durable and hard material, using a high percentage of quartz in aggregates of concrete can enhance the strength and durability of the surface texture of concrete carriageway.  In addition, such specification requires a high percentage of quartz content, thereby reducing the probability of presence of impurities like shell."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the load transfer mechanism for paving blocks in pedestrian footway?  In Hong Kong, footway is normally designed with paving slabs/interlocking blocks instead of concrete because the extensive use of concrete in pavement is boring. Moreover, poor appearance will result in concrete pavement due to frequently trench openings for utility work. In addition, owing to the prolonged setting and curing time of concrete, the use of concrete pavement inevitably generates disturbance to the general public.  The pedestrian loads are taken up through the following ways:  (i) Load carrying capacity of paving slabs/interlocking blocks are derived from their individual strength; (ii) Pedestrian loads are also supported by interlocking forces provided by friction transfer through the sand in vertical joints (K. K. Tang & Robert P. Cooper (1986)).  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 46"
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the function of a sand layer underlying paving slab/interlocking blocks?  Normally after the laying of sub-base layer of the paving slab/interlocking blocks, a 30mm thick sand bedding is screeded and tamped over the pavement area. Then paving slabs are laid horizontally with joints of 2-3mm wide and are laid in uphill direction. After completing the laying of paving slabs, sand used for filling joints is spread over the surface of the units and brushed into the joints such that all joints are completely filled. The paving slabs are then bedded into final position by using plate vibrators.  The sand layer serves the same purpose of normal blinding layer under concrete structure:  (i) Provide a level and flat surface for the paving slab/interlocking blocks to lay on; (ii) Protect the foundation (i.e. underground subgrade and sub-base layer) against adverse outside conditions (e.g. bad weather) during construction of the laying work of paving slab/interlocking blocks."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the function of longitudinal joints in concrete road pavements?  A longitudinal joint consists of a tie bar placed at the mid-depth of a concrete pavement and it is not intended for joint lateral movement. Then one may doubt the reasons of placing longitudinal joints in concrete pavements. In fact, longitudinal joints are normally designed at a regular spacing e.g. 4.5m to accommodate the effect of differential settlement of pavement foundation. When uneven settlement occurs, the tie bars in longitudinal joints perform as hinges (Ministry of Transport (1955)) which allow for the settlement of concrete carriageway. Moreover, it also serves to cater for the effect of warping of concrete due to moisture and temperature gradients by permission of a small amount of angular movement to occur so that stresses induced by restrained warping can be avoided.  Dowel bars are provided in longitudinal joints for the following reasons: (i) In case of the occurrence of uneven settlement between adjacent panels, it helps to maintain a level surface by transfer of loads through dowel bars. (ii) Keep the longitudinal joints close."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "For rigid pavement, what are the advantages of using lean concrete sub-base instead of traditional granular sub-base?  There are several shortcomings of using granular sub-base in concrete carriageway:  (i) Since sub-base is permeable, water can seep through sub-base and soil particles will be pumped out through contraction/expansion joints when subject to traffic load. Consequently, voids are formed underneath the pavement structure and the concrete pavement may crack under severe traffic loading. (ii) Lean concrete increases the strength and renders the roads capable of carrying heavy traffic loads (David Croney and Paul Croney (1992)). (iii) Due to workmanship problem, it may have uneven distribution of sub-base and this results in cracking of concrete carriageway when subject to severe traffic loading."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "In General Specification for Civil Engineering Works (1992 Edition), the design of roadbase material is based on recipe approach. Why?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 47 The design of roadbase material is based on recipe approach (David Croney and Paul Croney (1992)) because Hong Kong government follows the traditional British practice by adopting recipe design in which the aggregate grading envelope, the quantity and grade of bitumen are specified in the bituminous mix. This recipe of bituminous mix is derived based on past experience and good workmanship during construction. In fact, many countries nowadays adopt special design mix of roadbase which proves to produce satisfactory bituminous mixes to suit different site and design conditions.  In fact, recipe specification of bituminous materials does suffer from several drawbacks. Firstly, the conditions of traffic and climate of newly constructed bituminous road may differ from the conditions on which the recipe design is based. In case adjustment has to be made to the recipe design, it is very difficult to determine and assess the modifications required. Secondly, it poses problem to site engineers to assess the effects of minor non-compliance if recipe specification is adopted. Finally, the recipe mix may not be the most economical design which is dependent on site conditions."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "If the construction of concrete carriageway is carried out in summer, can expansion joints be omitted?  If the construction of concrete carriageway is carried out in summer, expansion joints may not be necessary as suggested by Arthur Wignall, Peter S. Kendrick and Roy Ancil. Expansion of concrete carriageway is mainly due to seasonal changes with an increase in temperature from that during construction to the ambient temperature (i.e. the temperature in summer). However, if the construction of concrete carriageway takes place in summer, the concrete carriageway will undergo contraction in the following winter, thus the space available in contraction joints can accommodate the future expansion in the next summer."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "If there is a delay of bituminous laying on top of sub-base, should tack coat be applied on the top surface of sub-base?  When there is a delay between bituminous laying of different bituminous layers (i.e. roadbase, base course etc.), a tack coat is applied on top of the bituminous layers because it helps to enhance better bonding between bituminous materials. If there is insufficient bonding between adjacent bituminous layers, they behave as separate independent layers which can hardly resist the traffic loads. When applying the tack coat, it should be sprayed uniformly on the bituminous surface and allowed for sufficient curing. The hot bituminous material laid on top of the coat would soften it, enabling the tack coat to partly fill voids in the bituminous materials. For emulsified asphalt type tack coats, they are normally diluted with water in order to achieve a more uniform application without excessive usage of asphalt. After the subsequent compaction is carried out, the coat would be interlocked with the bituminous materials. On the other hand, care should be taken to ensure that excessive coat would not be laid, otherwise slippage or shear cracks in the bituminous material would occur due to the relative thick layer of the tack coat applied.  However, for sub-base surface, priming coat instead of tack coat may be applied in the event of a delay in laying of bituminous layer on top of the sub-base layer. The function of the primer serves to maintain the existing surface condition for a longer period and it also provides an impermeable surface to prevent ingress of water or water loss by evaporation. Moreover, it fills the surface voids and protects the sub-base from adverse weather conditions. In addition, it also helps to promote adhesion between adjacent road layers and 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 48 to harden the surface."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is difference in purpose for conducting surface regularity test and sand patch test (test on texture depth)?  The purpose of surface regularity test is to measure the riding quality of pavements and the same requirement and standard is applied to both concrete and bituminous carriageway. On the other hand, sand patch test is used for checking the skid resistance of road pavements. Moreover, it is related to traffic noise because the intensity of noise generated from road traffic is related to texture depth of carriageway."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "In General Specification for Civil Engineering Works (1992 Edition), it specifies the temperature requirements for bituminous material during and after mixing. What is the reason behind this?  Temperature is one of the factors that govern the compaction of bituminous material and the air void content is found to decrease with an increase in compaction temperature. This phenomenon is explained by the viscosity-temperature relations: the higher is the viscosity of binders, the greater is the resistance to compaction. Therefore, in normal contract for bituminous laying, the temperature requirements for bituminous material during and after mixing are specified."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Can a sub-base layer serve as a drainage layer to remove water from pavement?  Besides providing load distribution in post-construction stage and working platform in construction stage, sub-base can also serve as a drainage layer to remove water coming from the pavement. For thick layers of road pavement, it is likely that the water leakage from pavement is insignificant and therefore the sub-base layer mainly serves to support the traffic stresses. However, for thin pavement layers, water penetration is quite substantial and therefore sub-base may also act as a drainage layer to remove these water."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "For unreinforced concrete carriageway, what is the sequence of closing and opening of expansion joints and contraction joints?  Let’s take an example to illustrate the sequence of closing and opening of joints (Ministry of Transport (1955)). For instance, an unreinforced concrete carriageway is constructed in winter. When temperature rises in the following summer, the section between expansion joints will expand as a whole single element resulting in the closure of expansion joints. This section of concrete pavement will move outwards from the mid-point between the expansion joints. In the next winter, each bay (i.e. concrete pavement between adjacent contraction joints) of concrete contracts about the midpoint of its length with opening of contraction joints.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 49   Fig. 6.2 Movement of joints in summer and winter."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "Are kerbs necessary in road pavements?  In general, kerbs are essential in road pavements due to the following reasons (based on Arthur Wignall, Peter S. Kendrick and Roy Ancil):  (i) They provide strength to the sides of road pavements and avoid lateral displacement of carriageway due to traffic loads. (ii) In terms of road safety, they serve as a separation line between footway and carriageway and aid car drivers in driving safely. (iii)They act as a vertical barrier to guide the surface runoff collected in road pavements to the gullies.   Fig. 6.3  20.What are the design considerations for dowel bars in joints of concrete carriageway?  The behaviour of dowel bars resembles that of piles in soils subject to lateral loads. Failure of the joint occurs by yielding of steel under bending action or by crushing of concrete due to bearing stresses.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 50 In general, the spacing of dowel bars should not be too close which may pose problems during construction. However, it should be not too wide to allow the occurrence of bending between the dowel bars. On the other hand, regarding the length of dowel bars, it should not be too long because the induced stress at the end of long dowel bars is insignificant and is not effective in transferring loads between adjacent concrete panels. However, if the dowel bars are too short, the stress at the face of joint is increased resulting in concrete crushing. Reference is made to Ministry of Transport (1955)."
  },
  {
    "chapter": "6 - Roadworks",
    "question": "What is the function of a separation membrane between concrete pavement slab and sub-base?  The separation membrane between concrete pavement slab and sub-base has the following functions:  (i) It aids in reducing the frictional forces between concrete slab and sub-base and helps to movement of concrete slab with respect to sub-base owing to changes in temperature and moisture. (ii) It prevents the loss of cement and water in immature concrete which significantly affects the strength and durability of hardened concrete. (iii)It avoids the mixing up of sub-base materials and freshly placed concrete.  Polythene sheeting, which is a waterproof material, is commonly used as separation membrane."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "Should emulsified asphalts or cutback asphalts be selected as tack coat in bituminous roadworks?  Emulsified asphalt is a suspension of asphalt in water by using an emulsifying agent which imposes an electric charge on asphalt particles so that they would be join and cement together. On the other hand, cutback asphalt is simply asphalt dissolved in petroleum. The purpose of adding emulsifying agent in water or petroleum is to reduce viscosity of asphalt in low temperatures.  The colour of emulsion for tack coat is brown initially during the time of application. Later, the colour is changed to black when the asphalt starts to stick to the surrounding and it is described as “break”. Finally, when water has all evaporated, the emulsion is said to have “set”. Similarly, for cutback emulsion, it is described to “cure” when the solvent has evaporated. However, there are several problems associated with cutback asphalts:  (i) Emulsified asphalt can be diluted with water so that a low application rate could be achieved. (ii) The evaporation of petroleum into atmosphere for cutback asphalt poses environmental problem. The cost of production of petroleum is higher than that of emulsifying agent and water.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 51"
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "What is the difference among cement plaster, cement render and cement screed? Under what situations should each of the above be used?  The purpose of plastering, rendering and screeding is to create a smooth, flat surface to receive finishes like paint, wallpaper etc.  Plastering is the intermediately coating of building materials to be applied on the internal facade of concrete walls or blockwalls. Rendering is the intermediate coating for external walls only. Screeding is the coating laid on floors to receive finishes like tiles, carpet, and marble...  Hence, these terms differ basically from the locations at which they are applied. Due to different locations of application of plasterwork, the proportion of material component for plaster and render is different. For example:  (i) Cement plaster Undercoat- cement:lime:sand (by volume) = 1:4:16 Finishing coat - cement:lime:sand = 1:12:30  (ii) Cement render Undercoat- cement:lime:sand (by volume) = 1:2:6 Finishing coat - cement:lime:sand = 1:3:6"
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "In the design of corbel beams in a pumping station, why are shear links designed in the top 2/3 of the section? What is the general advice on the design?  Corbel beams are defined as z/d<0.6 where z is the distance of bearing load to the beams’ fixed end (or called shear span) and d is depth of beams. The design philosophy is based on strut and tie system. To establish the design model, it is firstly assumed the failure surface, i.e. shear cracks extending to 2/3 of depth of beam. Experiment results verified that the failure cracks extended only to 2/3 of beam while the remaining 1/3 depth of concrete contributed as concrete strut to provide compressive strut force to the bearing loading.  Horizontal links are normally provided to corbel beams because experimental results indicated that horizontal links were more effective than vertical links when shear span/depth is less than 0.6. For shear span/depth>0.6, it should be not considered as corbel beams but as cantilevers.  In designing corbel beams, care should be taken to avoid bearing load to extend beyond the straight portion of tie bars, otherwise the corners of corbel beams are likely to shear off. Reference is made to L. A. Clark (1983).  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 52"
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "Given a 1m high staircase resting on solid concrete, would it be adequate to design nominal reinforcement for the staircase?  For the design of staircase, there are three main scenarios:  (i) Stairs spans longitudinally This kind of stairs refers to stairs spanning between landings only without any side supports. In this case, the staircase should be designed as a beam between two end supports (i.e. landing) and the main reinforcement is provided at the bottom of staircase slabs.  (ii) Stairs spanning transversely This kind of staircase is supported by sidewalls only and it may also be supported by stringer beams. For the case of sidewalls, it acts as a cantilever beam and the main reinforcement are provided the top surface of slab. For the case of staircase supported sideways by both sidewall and stringer beam, it should be designed transversely with end supports as sidewall and stringer beam and reinforcement is provided at the bottom of the staircase.  (iii) Stairs resting on solid support For stairs resting on solid supports, only nominal steel reinforcement is provided to control thermal and shrinkage cracking."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "In selecting screw pumps in polder scheme projects, what are the factors that affect the design capacity of screw pumps?  The commonly used angles of inclination for screw pumps are 30o, 35o and 38o. For screw pumps of relatively high lifting head, like over 6.5m, angle of inclination of 38o is normally used. However, for relatively lower head and high discharge requirement, angle of inclination of 30o shall be selected. In general, for a given capacity and lifting head, the screw pump diameter is smaller and its length is longer for a screw pump of 30o inclination when compared with a screw pump of 38o inclination.  To increase the discharge capacity of screw pumps, a larger number of flights should be selected. In fact, screw pumps with 2 flights are more economical that that with 3 flights in terms of efficiency and manufacturing cost. Moreover, the discharge capacity is also 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 53 determined by the screw pump diameter and sizes of 300mm to 5000mm are available in current market."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "What are the components of a waterproofing system in the roof of a typical pumping station?  In the design of a waterproofing system at the roof of a pumping station, normally the following components are:  (i) Above the structural finish level of the concrete roof, a screed of uniform thickness is applied to provide a smooth surface for the application of waterproofing membrane. (Screed of varying thickness can also be designed on the roof to create a slope for drainage.) The screed used for providing a surface for membrane should be thin and possess good adhesion to the substrate. Moreover, the screed aids in the thermal insulation of the roof. (ii) Above the screed, waterproofing membrane is provided to ensure watertightness of the roof. (iii) An insulation board may be placed on top of waterproof membrane for thermal insulation. In cold weather condition where the loss of heat at the roof is significant, the insulation board helps to reduce these losses. On the contrary, in summer the roof is heated up by direct sunlight and the insulation layer reduces the temperature rise inside the pumping station."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "In pumping stations one of the choices for the material of water tanks is fibre-reinforced plastic (FRP). What are the advantages associated with this kind of material?  There are two main advantages for FRP water tanks:  (i) It possesses high strength to weight ratio and this leads to the ease of site handling. (ii) It is highly resistant to corrosion and thus it is more durable than steel water tank."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "In the construction of pump troughs for accommodation of screw pumps, what is the construction method to ensure close contact between the screw pumps and the pump trough?  In the construction of screw pump troughs, trapezoidal-shaped troughs are usually formed by using normal formwork. In order to enhance close contact between screw pumps and troughs, upon lifting the screw pumps into the troughs screeding works is carried out. Screw pumps are set to rotate and screeds are placed between the gap of screw pumps’ blade and trapezoidal-shaped troughs during the rotating action of screw pumps. After the screed sets, it serves to prevent leakage of water during the pumping operation of screw pumps."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "Why are voids filled with lightweight infilling material in raft foundation of pumping stations?  To reduce the dead load and hence to reduce the settlement of pumping stations, the voids inside the raft foundations are filled with light material. If instead concrete is placed inside these voids, it poses severe thermal cracking problem and drastically increases loads to 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 54 pumping stations. The use of general fill is also not desirable because its self-weight is comparable to that of concrete. On the contrary, if these voids are left vacant, water may penetrate into these voids during future operation and increases the dead load of pumping stations during its normal operation. Therefore, lightweight infill material, which is non-water-absorbing and non-biodegradable, is designed inside these voids to avoid ingress of water and to reduce the dead load of the structure."
  },
  {
    "chapter": "7 - Pumping Station",
    "question": "What is the difference in arranging pumps in series and in parallel?  For identical pumps with similar functions, if the pumps arranged in series, the total head is increased without a change to maximum discharge. On the other hand, for pumps arranged in parallel to one another, the discharge is increased without any changes to maximum head."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "In terms of pumping performance, how should engineers determine the use of radial flow pumps and axial flow pumps?  Specific speed is usually defined for a pump operating at its maximum efficiency. In order to minimize the cost of future operation, it is desirable to operate the pumps as close to the maximum efficiency point as possible. The specific speed for radial flow pumps is relatively small when compared with that of axial flow pumps. This implies that radial flow pumps tend to give higher head with lower discharge while axial flow pumps tend to give higher discharge with lower head.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 55"
  },
  {
    "chapter": "8 - Reclamation",
    "question": "What are different approaches for reclamation in deep water region and shallow water region?  To illustrate the different approaches adopted for reclamation in deep water and shallow water region, the following example is used:  In deepwater region, consider the seabed level is –8.5mPD. After laying of geotextiles and 1.5m thick sand blanket, the top level of sand blanket is about –7mPD. Split barges are deployed for dumping public fill to –2.5mPD. Afterwards, end dipping of public fill by trucks will be carried out up to +2.5mPD which is the designed reclamation level. Between level –2.5mPD and +2.5mPD, it is too shallow for split barges to enter the water, thus the method of end dipping is used instead.  For shallow water region, the seabed level is taken as –5.5mPD in this example. With the laying of geotextiles and 1.5m sand blanket into position, the top level of sand blanket is about –4mPD. In this case, split barges are also used for reclamation work between the level –4mPD and –2.5mPD. After that, if end dipping is used for reclamation work above –2.5mPD, then in considering the relative thin layer of fill above seabed (1.5m sand blanket + 1.5m sand blanket), it stands a high chance that mud wave would occur in seabed. Therefore, half-loaded derrick barges are employed for reclamation up to level 0mPD. With a thicker layer of public fill now, end dipping can then be used for reclamation between 0mPD and +2.5mPD.  This above reclamation sequence is just an example to demonstrate the different considerations for reclamation in deep water and shallow water region."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "In case mud waves occur during reclamation, what are the possible solutions to rectify the situation?  (i) Option 1 – Complete Removal of All Disturbed Mud To remove all disturbed mud once mud waves occur is the fastest way to treat the problem. After that, filling material is used for replacing the disturbed mud. However, this option is a rather expensive option because it involves dredging of all disturbed mud and replacement of large amount of fill.  (ii) Option 2 – Accelerated consolidation of Disturbed Mud This option involves placement of surcharging loads on top of mud waves, together with installation of band drains to accelerate the consolidation of disturbed mud. This method suffers from the drawback that sufficient long time is required for the consolidation process of mud.  (iii) Option 3 – Partial Removal of Disturbed Mud This option is a combination of the first two options in which the top weak layer of mud is removed while the lower mud is treated with surcharging with band drain installation.  Note: Mud waves refer to excessive displacement of mud due to successive slip failure during reclamation."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "What is the importance of geotextiles and sand in reclamation works? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 56  For geotextiles used in reclamation, they serve mainly the following two purposes: (i) they separate reclamation fill from marine mud; (ii) they may act as reinforcement to enhance the stability of reclamation. However, the reinforcement function is still under heated debate because its performance as reinforcement depends on several factors like the directional strength of woven geotextiles and damage effect by installation of vertical band drains.  For sand: (i) it spreads the load of future public dump on top of it; (ii) it acts as drainage path for dissipation of excess pore water pressure for band drain installation."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "Geotechnical Instrumentation is frequently employed for monitoring the condition of reclamation. Sometimes two piezometers are installed inside the same borehole. What is the reason behind this?  For standpipes, they normally contain one plastic tube between its intention is to measure water level only. However, for piezometers, they are used for measuring pore water pressure in a certain depth below ground. For instance, if there are two clayey layers below ground at different depths, a multiple piezometer including two separate piezometers may be sunk at the same borehole to determine the pore water pressure at these layers respectively. This arrangement has the advantage that it saves the cost of installation of separate boreholes for several piezometers. However, the installation of multiple piezometers within the same borehole is affected by occurrence of leakage along the pipes as suggested by Marius Tremblay (1989)."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "What is the difference between standpipe, standpipe piezometer and piezometer?  A standpipe normally contains plastic pipes with perforated holes at the base. The annular space between the perforated tube and casing is filled with gravel or sand backfill. Under such an arrangement, standpipe is used to measure water level of a certain region.  A standpipe piezometer is a type of piezometer which measures pore water pressure at a certain level. It consists of plastic pipes without holes. The tip of the standpipe piezometer is perforated and the annular space between the tip of the piezometer and soil is filled with sand while the annular space between other parts of plastic tube and soil is filled with cement/bentonite grout to seal off water from entering the region of piezometer tip. This enables the pore water pressure in the region of piezometer tip to be measured. In essence, standpipe piezometers are installed to study the pore water pressure of a specified depth below ground. However, it suffers from the disadvantage that the response time is relatively slow in clayey soils. Reference is made to Marius Tremblay (1989)."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "For drained reclamation, what is the significance of smear zone induced by installation of band drains?  During installation of band drains, smear zones are created in which a zone of soil surrounding the band drains are disturbed. The compressibility of surrounding soils is increased and it results in the reduction of their permeability. In fact, the surrounding soils are remoulded during the installation process and the effectiveness of band drains is 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 57 reduced. In essence, for the reduced permeability of soils around band drains, it takes longer time to complete the consolidation process."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "In case a road passes through a reclaimed land and an existing land, what is the main concern regarding the design of pavements?  For an existing land, it is anticipated that there will be no major settlement within the design life of pavement structures. However, for a recently reclaimed land, even with surcharging and installation of vertical drains, some settlement will still occur after the construction. If a road pavement has to be constructed connecting these two areas, special design has to be made in this transition region. In order to avoid the occurrence of differential settlement which may damage the pavement structure, a transition slab may be designed to accommodate such movement (J. S. M. Kwong (1996))."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "In dredged reclamation, what are the considerations in selecting between trailer suction hopper dredgers and grab dredgers?  Trailer suction hopper dredgers are vessels which remove material off the seabed through hydraulic suction by using pumps. During the dredging operation, a mixture of soil and water is transported through suction pipe to storage hoppers. Significant turbulence inside the hoppers keeps the dredged mixture in suspension and this should be minimized to enhance the material to settle swiftly prior to the process of overflowing. Trailer suction hopper dredgers are mounted with draghead or dragarm pumps which increases the dredging depth and trims down the occurrence of cavitation as suggested by John B. Herbioh (1992). This machine is limited to dredging relatively low-strength material. Moreover, they cannot be deployed in very shallow waters and instead grab dredgers should be used. However, its dredging capacity is higher than that of grab dredger and it can be mobilized in relatively deep-water region.  Trailer suction hopper dredgers are renowned for their mobility, versatility and capability to operate in unfavorable sea conditions."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "What are the considerations in selecting marine plants and land plants for installation of band drains?  For installation of band drains by marine plants, it must have sufficient water depth to accommodate the marine plants in the first place. However, due to the effect of tides and waves, the establishment of the position for installation of band drains and the subsequent installation works may be affected. In addition, the establishment cost of marine plants is higher than that of land plants.  For installation of band drains by land plants, difficulty may be encountered during the installation of band drains through the reclaimed layer e.g. C&D material. Land plants may take longer construction time due to the above-mentioned difficulty. Sometimes when the supply of public fill is increased suddenly, it may be preferable to place these fill immediately into position and in this situation the installation of band drains (originally installed by marine plants) is delayed so that the construction of band drains is changed to using land plants."
  },
  {
    "chapter": "8 - Reclamation",
    "question": "For installation of silt curtains, why is it not desirable to design the curtain to 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 58 touch the seabed?  Silt curtains are impermeable vertical barriers extending from the seawater surface to its designed depth. The curtains are held in a vertical position by the carrier float on their top and a curtain weight at their bottom. A tension cable is designed at the carrier float to resist stresses incurred by currents. Moreover, the silt curtains are anchored to the seabed to hold them in the designed configuration.  In essence, the depth of silt curtains should not be so long and touch the seabed because the bottom segment of the silt curtains would be trapped inside the newly accumulated sediment, thus resulting in sinking of the curtain. Consequently, it is difficult to remove these sunken curtains. Moreover, reversal tidal and current actions may cause the movement of bottom region of curtains which stir up the settled suspensions and induce additional turbidity."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "What are the functions of slip joints in blockwork seawalls?  Slip joints are joints which are formed through a complete vertical plane from the cope level to the toe level of seawalls. These joints are designed in blockwork seawalls to cater for possible differential settlements between adjacent panels of seawalls. The aggregates inside the half-round channels in slip joints allow for the vertical movements induced by differential settlement and at the same time providing aggregate interlocking forces among adjacent panels of seawalls to link the panels in one unit against the lateral earth pressure exerted on seawall.  Besides, slip joints provide a path for the relief of water pressure developed and allow the lateral movement (e.g. contraction) due to seasonal variations.  Note: For details of slip joints, reference is made to CEDD Standard Drawing No. C3008C.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 59"
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "When designing a water storage tank, should movement joints be installed?  In designing water storage tanks, movement joints can be installed in parallel with steel reinforcement. To control the movement of concrete due to seasonal variation of temperature, hydration temperature drop and shrinkage etc. two principal methods in design are used: to design closely spaced steel reinforcement to shorten the spacing of cracks, thereby reducing the crack width of cracks; or to introduce movement joints to allow a portion of movement to occur in the joints.  Let’s take an example to illustrate this. For 30m long tanks wall, for a seasonal variation of 35 degree plus the hydration temperature of 30oC, the amount of cracking is about 8.8mm. It can either be reduced to 0.3mm with close spacing or can be absorbed by movement joints. Anyway, the thermal movement associated with the seasonal variation of 35oC is commonly accounted for by movement joints.  For water-retaining structure like pumping stations, the crack width requirement is even more stringent in which 0.2mm for severe and very severe exposure is specified in BS8007. It turns out to a difficult problem to designers who may choose to design a heavy reinforced structure. Obviously, a better choice other than provision of bulky reinforcement is to allow contraction movement by using the method of movement joints together with sufficient amount of reinforcement. For instance, service reservoirs in Water Supplies Department comprise grids of movement joints like expansion joints and contraction joints."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "What is the crack pattern induced by hydration due to internal restraint?  Let’s take a circular column as an example to illustrate this.  When the temperature is rising, the inner concrete’s temperature is higher than outer concrete’s temperature and the inner concrete is expanding. This induces pressure to the outside and the induced compressive stress will result in formation of radial cracks near the surface of concrete.  When the temperature drops, the concrete at the outside drops to surrounding temperature while the concrete at the central region continues to cool down. The contraction associated with inner concrete induces tensile strains and forms cracks tangential to the circular radius.  3.What is the purpose of adding cooling pipes or even using cold water for concrete in concreting operation?  All these measures aim at reducing the placing temperature and reducing thermal cracks induced during concreting of massive pours. Since the final concreting temperature should be the ambient temperature, reducing the initial placing temperature will also lower the peak hydration temperature. Therefore, the temperature difference between the hydration peak and the ambient temperature is reduced accordingly and subsequently the thermal effect to concrete structure can be reduced by controlling the placing temperature."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "Is the material of formwork (timber or steel) helps to reduce thermal cracks in 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 60 concreting operation?  To answer this question, one must fully understand the effect of formwork on the temperature of concreting structure. Without doubt, with better insulation of structure by timber formwork, the overall rise of temperature and hence the peak hydration temperature is also increased. However, for a well-insulated structure, the temperature gradient across concrete element is reduced. Therefore, the use of well-insulated formwork (like timber) increases the maximum temperature and reduces the temperature gradient across the structure at the same time. Hence, whether steel or timber formwork should be used to control thermal cracking is dependent on the restraints and the size of section.  If the section under consideration is thick and internal restraint is the likely cause to thermal cracking, then timber formwork should be used. On the other hand, if external restraint is the main concern for thermal cracking, then steel formwork should be used instead."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "What is the importance of critical steel ratio in calculating thermal reinforcement?  The fulfillment of critical steel ratio means that in construction joints or planes of weakness of concrete structure, steel reinforcement will not yield and concrete fails in tension first. This is important in ensuring formation of more cracks by failure of concrete in tension, otherwise failure in steel reinforcement would produce a few wide cracks which is undesirable."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In selection of waterstop, shall engineers use plain dumb-bell type or center-bulb type?  The plain dumb-bell type is used for joint location where small movements are anticipated. Therefore, construction joints are desirable locations of this type of waterstop. On the other hand, center-bulb type waterstop is suitable for expansion joints or locations where lateral and shear movements occur due to settlement or deflection. Reference is made to W. L. Monks (1972)."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "Why do BS8007 specify the allowable crack width of water retaining structure as 0.2mm for severe or very severe exposure?  For crack width less than 0.2mm, it is assumed that the mechanism of autogenous healing will take place in which the crack will automatically seal up and this would not cause the problem of leakage and reinforcement corrosion in water retaining structure.  When the cracks are in inactive state where no movement takes places, autogenous healing occurs in the presence of water. However, when there is a continuous flow of water through these cracks, autogenous healing would not take place because the flow removes the lime. One of the mechanisms of autogenous healing is that calcium hydroxide (generated from the hydration of tricalcium silicate and dicalcium silicate) in concrete cement reacts with carbon dioxide in the atmosphere, resulting in the formation of calcium carbonate crystals. Gradually these crystals accumulate and grow in these tiny cracks and form bonding so that the cracks are sealed. Since the first documented discovery of autogenous healing by the French Academy of Science in 1836, there have been numerous previous proofs that cracks are sealed up naturally by autogenous healing. Because of its self-sealing property, 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 61 designers normally limit crack width to 0.2mm for water retaining structures."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In designing reservoirs, the indirect tensile strength of the concrete mix is specified to be less than a specific value (e.g. 2.8N/mm2) for potable water. Why should engineers put an upper limit of indirect tensile strength?  The crack width formation is dependent on the early tensile strength of concrete. The principle of critical steel ratio also applies in this situation. The amount of reinforcement required to control early thermal and shrinkage movement is determined by the capability of reinforcement to induce cracks on concrete structures. If an upper limit is set on the early tensile strength of immature concrete, then a range of tiny cracks would be formed by failing in concrete tension. However, if the strength of reinforcement is lower than immature concrete, then the subsequent yielding of reinforcement will produce isolated and wide cracks which is undesirable for water-retaining structures. Therefore, in order to control the formation of such wide crack widths, the concrete mix is specified to have an indirect tensile strength at 7 days not exceeding a certain value (e.g. 2.8N/mm2 for potable water). Reference is made to R. D. Anchor, A.W. Hill and B. P. Hughes (1979)."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "Shall reversible moisture movement be taken into account in estimating movement for movement joints?  The size of concrete is affected by changes in atmospheric humidity: moisture causes expansion while drying causes shrinkage. Such moisture movement is reversible. This is totally different from drying shrinkage in which concrete slowly loses moisture during hardening, thus causing irreversible shrinkage.  In fact, the variation of humidity and the estimated reversible moisture movement is not significant (about 30%) and therefore, its contribution to movement does not justify for movement joints as suggested by MN Bussell & R Cather (1995)."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In the design of watermains, how to decide the usage of double air valves and single air valves?  Single air valves allow squeezing air out of the pipeline in automatic mode in high-pressure condition and are normally designed in high points of watermain in which air voids are present. Double air valves basically serve the same purpose except that it has another important function: it can get air into/out of the pipeline during low-pressure condition.  In WSD practice, watermain are normally divided into sections by installation of sectional valves to facilitate maintenance. In a single isolated pipeline section bounded by two sectional valves, at least a double air valve should be installed. During normal maintenance operation like cleansing of watermain, water inside pipelines is drawn from washout valves. However, as normal watermain is subject to very high pressure like 1.5MPa and the sudden withdrawn of water will cause a transient vacuum condition and will damage the watermain. Therefore at least one double air valve should be present to allow air to squeeze in to balance the pressure and this protects the pipeline from damaging.  In essence, for local high points single air valves should be installed. Within a section of pipeline, at least one double air valve should be installed.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 62"
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "Why are two gate valves required in normal practice to form a washout valve?  In fact, the situation is analogous to that of fire hydrants in which two gates valves are installed with a single fire hydrant. Washout valves are used for normal maintenance work of watermain like allowing flowing out of water during cleaning of watermain. At the junction where a tee-branch out to a washout point, a gate valve is installed to separate the two pipelines. However, this gate valve is open during normal operation while another gate valve further downstream is installed (closed during normal operation). If the downstream gate valve is not installed in position, then the pipe section of branched-out watermain will be left dry during normal operation and there is a high probability that damage to watermain and frequent leakage would occur. With the downstream gate valve installed, the segment of branched-out watermain contains water in normal operation. In case there is any leakage, it can be readily detected by using the two gate valves."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "After the construction of watermain, prior to hydrostatic pressure test, swabbing is carried out. What is the purpose of swabbing?  Pipelines should be tested before commissioning to check the strength of watermain and the absence of leak. Before carrying out hydrostatic pressure test, swabbing is conducted to clear out rubbish and dirt left inside the pipeline during construction. Swabbing is required for pipes less than 600mm diameter because for larger size of pipes, they can be inspected internally to ensure cleanliness.  After carrying out of hydrostatic pressure test, test for water sterilization is then conducted which involves collecting water sample from the pipeline. The purpose is to check the water quality like colour, turbidity, odor, pH value, conductivity etc. and is compared with the quality of water drawn from water supply point."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In the design of watermain, the normal practice is to use ductile iron for pipe size less than 600mm and to use steel for pipe size more than 600mm. Why?  For watermain pipe size less than 600mm, ductile iron is normally used because internal welding for steel pipes below 600mm is difficult to be carried out. Moreover, it requires only simple jointing details which allow for faster rate of construction. For watermain pipe size above 600mm, steel pipes are recommended because steel pipes are lighter than ductile iron pipes for the same material strength and therefore the cost of steel pipes is less than that of ductile iron pipes. In addition, in areas of difficult access the lighter mild steel pipes pose an advantage over ductile iron pipes for easy handling."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In the design of service reservoirs, horizontal reinforcement in walls of reservoirs is placed at the outer layer. Why?  Since service reservoirs are designed as water-retaining structures with stringent requirement of crack width control, the design of reinforcement of service reservoirs is under the control of serviceability limit state. For the walls of service reservoirs, contraction and expansion of concrete are more significant in the horizontal direction of walls because of their relatively long lengths when compared with heights. In this connection, in order to minimize the usage of reinforcement, horizontal bars are placed at the outmost layer so that the distance of reinforcement bars to concrete surface is reduced. Since the shorter is the distance to the point of concern, the smaller is the crack width and 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 63 hence with such reinforcement arrangement advantages are taken if the reinforcement bars in the critical direction are placed closest to concrete surface."
  },
  {
    "chapter": "9 - Water Retaining Structure and Waterworks",
    "question": "In the design of service reservoirs, how are reservoir floors designed to prevent leakage of water due to seasonal and shrinkage movements?  There are in general two main approaches in designing floors of service reservoirs:  (i) In the first method, movement joints are designed in each panel of reservoir floors so that they can expand and contract freely. Each panel is completely isolated from one another and a sliding layer is placed beneath them to aid in sliding. (ii) The second method, on the contrary, does not make provision to free movement. Due to seasonal and shrinkage movements, cracks are designed to occur in the reservoir floors such that very tiny cracks are spread over the floor and these cracks are too small to initiate corrosion or leakage. However, in this case, the amount of reinforcement used is much larger than the first approach."
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "What is the difference between air chamber and surge tank?  Air chambers and surge tanks are normally installed in watermain to ease the stress on the system when valves or pumps suddenly start up and shut down. A surge tank is a chamber containing fluid which is in direct contact with the atmosphere. For positive surge, the tank can store excess water, thus preventing the water pipes from expansion and water from compression. In case of downsurge, the surge tank could supply fluid to prevent the formation of vapour column separation. However, if the surge pressure to be relieved is very large, the height of surge tank has to be designed to be excessively large and sometimes it is not cost-effective to build such a chamber. On the contrary, a air chamber can be adopted in this case because air chamber is a enclosed chamber with pressurized gases inside. The pressure head of gas inside the air chamber is the component to combat the hydraulic transient. However, air chamber has the demerits that regular maintenance has to be carried out and proper design of pressure level of gas has to be conducted.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 64"
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "In the design of pipe jacking, what particular areas on pipe joints should engineers take care of?  Since in pipe jacking, the jacked pipes could hardly be jacked in the designed level and alignment and some deviation from the original one is commonly acceptable provided that the deviation are within the tolerance of the Contract. However, in order to avoid damage made to the pipe joints due to overstressing, it is necessary to estimate the stress concentrations resulting from these angular deflections.  Note: Pipe jacking is a trenchless method in which pipes are jacked underground from jacking pits and receiving pits."
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "What are the differences in design between normal precast concrete pipes and pipes used for pipe jacking?  For pipes used for pipe jacking, they should possess the following characteristics:  (i) Pipes should have high concrete strength to withstand the stress induced during the jacking process. (ii) There is tight tolerance in pipe dimension and the pipe joints are specially designed to provide trouble-free joint details. Two commonly available joints are rebated joint and butt end joint. (iii) Pipes preferably should have smooth external concrete finishes to reduce the friction between the pipes and surrounding soil."
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "Why are intermediate jacks designed in some pipe jacking projects?  When the process of pipe jacking stops, building up of resistance is very fast in some soil. For instance, increase in jacking force of 20%-40% is required for a stoppage of pipe jacking for just several hours. Hence, it is recommended that pipe jacking should be carried out in a continuous operation.  For a long pipeline, the frictional forces established between the jacking pipes and soil is high. Sometimes, such resisting forces may be so high that they can hardly be overcome by the jacks in jacking pits. Moreover, even if the jacks can overcome the high frictional forces induced during jacking, high loads are experienced in jacking pipes during driving. Jacking pipe’s material e.g. concrete may not have sufficient strength to resist these stresses and hence pipe strength is another factor that govern the need for consideration of using intermediate jacks."
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "What is the function of packing materials in the joint of concrete pipes in pipe jacking?  Packing materials are about 10mm to 20mm thick and are normally made of plywood, fibreboard or other materials. In case packing materials are absent in pipe joints for pipe jacking, then any deflection in the joints reduces the contact area of the concrete and it leads to spalling of joints due to high stresses induced. With the insertion of packing material inside the pipe joints, the allowable deflection without damaging the joint during 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 65 the pipe jacking process can be increased."
  },
  {
    "chapter": "10 - Pipe Jacking and Microtunneling",
    "question": "In pipe jacking/microtunneling, it is commonly accepted that cover depths of jacking pipes cannot be too shallow (i.e. less than 2D where D is the diameter of jacking pipes). Why?  For pipe jacking/microtunneling, the causes of large settlement are loss of face stability, failure to stabilize ground around shafts, presence of annular space around pipes and shield, drag along pipe joints, etc. The settlement mechanism of shallow depths of pipe jacking/microtunneling is the formation of a settlement trough on top of the jacking pipes. The width of the trough depends on soil properties; the larger is the cover depth of jacking pipes, the larger is the width of settlement trough. For the same soil volume loss due to pipe jacking/microtunneling, the width of settlement trough for shallow cover depth is smaller and therefore it results in a larger vertical maximum settlement."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In precast concrete jacking pipes, sometimes grout holes are designed inside these precast pipes. Why?  Grout holes are present in precast jacking pipes for the following reasons:  (i) They serve as the locations for injection of bentonite or other lubricant. Lubricant is used for both granular soils and cohesive soils to trim down the frictional resistance. For cohesive soils, the soils cannot get onto the pipes by the presence of lubricant and the shearing plane lies within the lubricant as suggested by R. N. Craig (1983). On the other hand, for granular soils, the lubricant mixes with soils with a significantly reduced friction. With the use of lubricant, longer pipe lengths can be jacked without the use of intermediate jacking station. (ii) They provide the inlet locations for subsequent grouting works after completion of pipe jacking to fill completely the void space between the pipes and surrounding soils. (iii)They are used as lifting holes when placing the precast jacking pipes into rails inside the jacking pits.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 66"
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "It is not necessary to design nominal reinforcement to piles. Is it true?  In BS8110 and BS5400 Pt.4, they require the provision of nominal reinforcement for columns. However, for pile design the requirement of nominal reinforcement may not be necessary. Firstly, as piles are located underground, the occurrence of unexpected loads to piles is seldom. Secondly, shear failure of piles is considered not critical to the structure due to severe collision. Moreover, the failure of piles by buckling due to fire is unlikely because fire is rarely ignited underground.  However, the suggestion of provision of nominal reinforcement to cater for seismic effect may be justified. Reference is made to J P Tyson (1995)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "How do rock sockets take up loads?  The load transfer mechanism is summarized as follows:  When a socketed foundation is loaded, the resistance is provided by both rock socket wall and the socket base and the load distribution is a function of relative stiffness of foundation concrete and rock mass, socket geometry, socket roughness and strength. At small displacements the rock-socket system behaves in an elastic manner and the load distribution between socket wall and socket end can be obtained from elastic analysis. At displacements beyond 10-15mm, relative displacement occurs between rock and foundation and the socket bond begins to fail. This results in reduction of loads in rock-socket interface and more loads are transferred to the socket end. At further displacements, the interface strength drops to a residual value with total rupture of bond and more loads are then distributed to the socket end."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In designing mini-piles, should the strength of grout be neglected during assessment of loading carrying capacity?  In designing min-piles, there are two approaches available:  (i) In the first approach, the axial resistance provided by the grout is neglected and steel bars take up the design loads only. This approach is a conservative one which leads to the use of high strength bars e.g. Dywidag bar. One should note that bending moment is not designed to be taken up by min-piles because of its slender geometry. (ii) In the second approach, it involves loads to be taken up by both grout and steel bars together. In this way, strain compatibility requirement of grout and steel has to be satisfied."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the considerations in determining whether casings should be left in for mini-piles?  Contrary to most of pile design, the design of min-piles are controlled by internal capacity instead of external carrying capacity due to their small cross-sectional area.  There are mainly two reasons to account for designing mini-piles as friction piles:  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 67 (i) Due to its high slenderness ratio, a pile of 200mm diameter with 5m long has a shaft area of 100 times greater than cross-sectional area. Therefore, the shaft friction mobilized should be greater than end resistance. (ii) Settlements of 10%-20% of pile diameter are necessary to mobilize full end bearing capacity, compared with 0.5%-1% of pile diameter to develop maximum shaft resistance.  Left-in casings for mini-piles have the following advantages:  (i) Improve resistance to corrosion of main bars; (ii) Provide additional restraint against lateral buckling; (iii) Improve the grout quality by preventing intrusion of groundwater during concreting; (iv) Prevent occurrence of necking during lifting up of casings during concreting."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the purpose of post-grouting for mini-piles?  Post-grouting is normally carried out some time when grout of the initial grouting work has set (e.g. within 24 hours of initial grouting). It helps to increase the bearing capacity of mini-piles by enhancing larger effective pile diameter. Moreover, it improves the behaviour of soils adjacent to grouted piles and minimizes the effect of disturbance caused during construction. In essence, post-grouting helps to improve the bond between soils and grout, thereby enhancing better skin friction between them.  During the process of post-grouting, a tube with a hole at its bottom is lowered into the pile and grout is injected. The mechanism of post-grouting is as follows: the pressurized grout is initially confined by the hardened grout and can hardly get away. Then, it ruptures the grout cover and makes its way to the surrounding soils and into soft regions to develop an interlock with harder soil zones. In order to enhance the pressurized grout to rupture the initial grout depth, a maximum time limit is normally imposed between the time of initial grouting and time of post-grouting to avoid the development of high strength of initial grout. Consequently, the effect of soil disturbance by installation of casings and subsequent lifting up of casings would be lessened significantly."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In designing the lateral resistance of piles, should engineers only use the earth pressure against pile caps only?  In some design lateral loads are assumed to be resisted by earth pressure exerted against the side of pile caps only. However, it is demonstrated that the soil resistance of pile lengths do contribute a substantial part of lateral resistance. Therefore, in designing lateral resistance of piles, earth pressure exerted on piles should also be taken into consideration.  In analysis of lateral resistance provided by soils, a series of soil springs are adopted with modulus of reaction kept constant or varying with depth. The normal practice of using a constant modulus of reaction for soils is incorrect because it overestimates the maximum reaction force and underestimates the maximum bending moment. To obtain the profile of modulus of subgrade reaction, pressuremeter tests shall be conducted in boreholes in site investigation. Reference is made to Bryan Leach (1980)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In some codes, they limit the ratio of weight of hammer to weight of pile for pile driving. What is the reason behind this? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 68  When a hammer with initial motion collides with a stationary pile, the transfer of energy is most efficient when the two masses are comparable. That is the reason why some codes limit the ratio of weight of hammer to the weight of pile to be more than 0.5. If the weight of hammer is too low, most of energy during hammer driving is distributed to the hammer and this causes tension induced in hammer and results in inefficient transfer of energy."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "Should engineers rely solely on Hiley’s formula in the design of H-piles?  About 90% of H-piles adopt Hiley’s formula for design. However, this formula is only applicable to pile lengths less than 30m and is suitable for course-grained materials (not suitable to fine-grained soils) as suggested by GEO (1996). In Hiley’s formula, by observing the penetration of piles after the hammer impact, the pile capacity could be readily obtained from the response of the impacting force. Therefore, the individual pile capacity could be obtained by this dynamic method.  However, in normal foundation, groups of H-piles are present and the soil foundation may not be able to support these H-piles simultaneously even though individual piles are proven to have sufficient capacity by using dynamic method. In this case, static method should be employed to ascertain if the soil foundation could support these H-piles."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the function of drilling fluid in rotary drilling in site investigation?  Drilling fluid in rotary serves two main purposes: (i) Facilitate the rotation of drilling tube during rotary drilling; (ii) Act as a cooling agent to cool down heat generated during drilling operation.  Traditionally, water is normally employed as drilling fluid. However, it suffers from the following drawbacks: (i) It affects the stability of nearby ground with the introduction of water into the borehole (borehole for soil; drillhole for rock); (ii) It affects the quality of sample by changing the water content of soil samples collected from the borehole/drillhole.  Substitutes are available in market to replace water as drilling fluid (e.g. white foam)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the differences in function between rock anchors and rock sockets?  Rock anchors are used primarily for resisting uplift forces. On the contrary, rock sockets serve three main purposes:  (i) Rock socket friction and end bearing to resist vertical load; (ii) Passive resistance of rock sockets contribute to resistance of lateral load; and (iii) Socket shaft friction is also used for resisting uplifting forces. But only 70% of this capacity should be used because of the effect of negative Poisson ratio.  Note: Rock anchors, which may consist of a high tensile bar or a stranded cable, are provided for tension piles when there are insufficient soil covers to develop the required uplifting resistance."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the functions of cap block, drive cap and pile cushion in driven piles? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 69  Cap block is installed between the hammer end and the drive cap to control the hammer blow in order to protect both the hammer and the pile from damage. When the hammer hits the cap block, it compresses elastically and reduces the peak forces, thereby lengthening the time of hammer blow. Moreover, it should be capable of transmitting the hammer energy effectively to the piles.  Drive cap is inserted at hammer tip to enhance uniform distribution of hammer energy to the pile. Pile cushion is positioned between the drive cap and the pile top. It intends to protect the pile from driving stress induced during hammer blows. Moreover, it also serves to provide a uniform driving load on top of the pile.  12.What is the significance of driving sequence of driven piles?  For basement construction, if piles are driven from the centre to the perimeter, there is a tendency of soils to move outwards. Such lateral movement of soil may cause damage to nearby structures and utilities.  However, if piles are driven from the outside perimeter inwards, there are little soil lateral movements. This results in a well-compacted centre with an excess pore water pressure built up to resist the loading of piles. Consequently, shorter pile lengths than the original designed ones may result. However, some time after the pile driving operation, the excess pore water pressure is dissipated and the shorter driven piles may not be able to take up the original design loads. In this situation redriving is required to drive the piles to deeper depths after dissipation of excess pore water pressure."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the function of followers in driven H-piles?  A follower is an extension between the pile head and the hammer that transfers the blow to the pile in which the pile head cannot be reached by the hammer or is under water .For construction of driven piles, the piling frame and hammer are normally erected on existing ground level but not at the base of pile caps. However, H-piles are designed to be terminated near the base of pile caps. If piles are driven at ground level, a certain length of H-piles is wasted and cut when constructing pile caps. In this connection, pile followers are used so as to save the wasted section of H-piles because followers can be removed during subsequent construction of pile caps."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the advantages of using top-down approach in basement construction?  The advantages of top-down approach are listed below:  (i) The structures above ground can be carried out simultaneously with the structures below ground. This greatly reduces the time for construction. (ii) By using this approach, settlement can be reduced. (iii) Since the permanent columns and slabs can be utilized to support loadings during construction, it saves the cost of formwork.  Note: Top-down approach means construction of basement is carried out from ground level downwards."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the methods to tackle negative skin friction? 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 70  (i) Use slender pile sections (e.g. H-pile or precast pile) because smaller pile area when subject to the same working load would produce higher deformation, thus increasing the relative downward movement of piles. (ii) In a certain region of H-piles for ground water table fluctuation, painting is applied on the surface of H-piles because the rise and fall of water table contribute to the corrosion of H-piles. On the other hand, to reduce the effect of additional loads brought about by negative skin friction, bitumen is applied on the pile surface corresponding to the region of soils that has negative skin friction. However, bitumen should not be applied to the whole section of H-piles because it would be unable to derive the designed frictional reaction from soils. (iv) Design the piles as end-bearing so that they can take up more load."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In piling works, normally founding levels of bored piles are defined by using total core recovery or rock quality designation (RQD). Are there any problems with such specification?  The use of total core recovery to determine the founding level may not be able to indicate the quality of rock foundation for piles because it depends on the drilling technique and drilling equipment (GEO (1996)). For instance, if standard core barrels are used to collect samples, it may indicate sufficient core recovery for samples full of rock joints and weathered rock. On the other hand, if triple tube barrels are used for obtaining soil samples, samples with joints and weathered rock can also achieve the requirements of total core recovery.  In case RQD is adopted for determining founding levels, it may also result in incorrect results. For instance RQD does not indicate the joints and infilling materials. Moreover, as it only measures rock segments exceeding 100mm, rock segments exceeding 100mm is considered to be of good quality rock without due consideration of its strength and joint spacing."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the head details of H-piles under compression and subject to bending moment?  For steel sections referred to in BS5950, universal bearing pile is characterized by having equal flange and web thickness while universal column has different flange and web thickness. Universal columns can also be used as bearing piles.  In the design of the head details of H-piles, there are three typical cases to be considered, namely compression piles, tension piles and piles with bending moment at the head in addition to tension or compression. The design of these piles recommended by G. M. Cornfield (1968) is listed below:  (i) Compression piles For this type of piles, H-piles should be embedded 150mm in concrete pile caps and it is not necessary to use any dowels and capping plates in their connection.  (ii) Tension piles A number of hook-ended bars are welded to the top of H-piles.  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 71 (iii) Piles with bending moment at their head (tension or compression) The depth of embedment of piles into pile caps is substantially increased and loads are transferred by horizontal bars welded to piles’ flanges."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In deep excavation, adjacent ground water table is drawn down which may affect the settlement of nearby buildings. What is the remedial proposal to rectify the situation?  One of the methods to control settlement of nearby buildings due to excavation work is by recharging. Water collected in wells in deep excavation is put back to the top of excavation in order to raise the drawn-down water table. The location of recharge should be properly selected to ensure the soil is sufficiently permeable to transfer the pumped water back near the affected buildings."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the significance of quality of bentonite slurry in the construction of diaphragm walls?  The quality of slurry plays an important role in the quality of diaphragm walls. Firstly, if a thick slurry cake is formed in the interface between slurry and in-situ soil, it has a tendency to fall off during concreting works and it mixes with freshly placed concrete. Moreover, large thickness of slurry cake would reduce the concrete cover and affect the future durability performance of diaphragm walls."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "During concreting of diaphragm walls, three tremie pipes are used in one time. However, only one concrete truck is available. How should the concreting works be carried out?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 72 The most ideal situation is to supply each tremie pipe with a single concrete truck. However, if only one concrete truck is available, all the fresh concrete in the truck should not be placed in one single tremie pipe. With all fresh concrete placed in one single tremie pipe while the others left void, then due to the huge supply of concrete to the tremie pipe, a small concrete hump may form at the base of the tremie pipe and it is likely that it may collapse and trap the slurry inside the diaphragm walls. Therefore, the fresh concrete should be evenly shared among the tremie pipes to avoid such occurrence."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the purpose of conducting load test for piling works?  Pile load test provides information on ultimate bearing capacity but not settlement behavior. In essence, it can determine if the load is taken up by the stratum designed or if the centre of resistance is at the design location in piles as suggested by Robert D. Chellis (1961).  After conducting load tests, the curve of movement of pile head (Settlement against load) and the curve of plastic deformation can be plotted. By subtracting the curve of plastic deformation from the curve of pile head movement at each load, the curve of elastic deformation can be obtained. For piles of end-bearing type unrestrained by friction, the theoretical elastic deformation can be calculated from e=RL/AE where e is elastic deformation, L is pile length, A is area of pile, E is Young’s Modulus of pile material and R is the reaction load on pile. By substituting e in the formula, the elastic deformation read from the curve of elastic deformation, L can be obtained which shows the location of the centre of resistance corresponding to that load."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "Why are vibrators not used in concrete compaction in piling works?  Concrete for piles should be a high-slump self-compacting mix which is capable of flowing between reinforcement cage with ease. Since concrete is designed to be self-compacting, vibrators are not used for providing further compaction. Moreover, the concrete in piles is compacted by energy derived from free falling. However, if vibrators are used, the vibrated concrete may be compacted to the sides of the concrete casings and hinders the lifting up of casings. Reference is made to GEO (1996)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In Hiley’s formula for driven piles i.e. R=E/(s+0.5c), why is a coefficient of 0.5 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 73 applied for the term elastic deformation of piles and soil?  Hiley’s formula is based on the principle of energy conservation in which the energy brought about by hammers during the action of hitting are transferred to piles in ground. When the hammer force and displacement is plotted, the energy absorbed by piles is the area under the curve. Since the curve of elastic component is linear with a positive slope, the area i.e. energy should be the area of triangle (0.5xRxc) where R is reaction force and c is elastic compression due to helmet, piles and soil system. For settlement, it is of horizontal line in force-displacement diagram and hence the energy transferred to pile-soil system is (Rxs)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "For a rigid pile cap with vertical piles at the middle and raking piles at the sides, what is the pattern of load distribution of piles in such arrangement?  Due to the effect of interaction of individual piles, the central piles tend to settle more than the edge piles when the pile cap is under a uniform load. Therefore, raking piles at the edge take up a higher fraction of total loads and are subject to higher axial and bending loads in case the pile cap is stiff. In the extreme case, failure of these raking edge piles may occur."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What are the problems associated with prestressed concrete piles (Daido)?  The origin of Daido piles comes from Japan where these prestressed concrete piles are used as replacement plies. Holes are pre-formed in the ground and Daido piles are placed inside these pre-formed holes with subsequent grouting of void space between the piles and adjacent ground. However, in Hong Kong Daido piles are constructed by driving into ground by hammers instead of the originally designed replacement method. Since the installation method of Daido piles is changed, construction problems like deformation of pile tip shoes, crushing of concrete at pile tip etc. occur. Reference is made to B. W. Choy (1993)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "Which one is a better choice, a large diameter piles or a system of several smaller piles with the same load capacity?  200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 74 The choice of a large diameter pile suffers from the disadvantage that serious consequences would occur in case there is setting out error of the pile. Moreover, in terms of cost consideration, for the same load capacity the cost of a group of small diameter piles is generally lower than that of a large diameter pile. On the other hand, for small diameter piles i.e. mini-piles, they are advantageous in site locations with limited headroom and space. In addition, in some structures with only a few piles, it is uneconomic because of its high mobilization cost. Reference is made to Dr. Edmund C Hambly (1979)."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "What is the difference between capping beams and ground beams for piles?  Capping beams for piles aim at transferring loads from closely spaced columns or walls into a row of piles. On the other hand, ground beams are beams provided between adjacent pile caps and they perform as compression struts or ties in an attempt to prevent lateral displacement or buckling of piles under uneven distribution of loads on pile caps. Both of them have to be specially designed to cater for differential settlement of piles.  Capping beam performs the same functions as pile caps. However, ground beams are structural elements to connect adjacent pile caps to improve the stability of foundation."
  },
  {
    "chapter": "11 - Piles and Foundation",
    "question": "In modeling a nonrigid mat foundation by using elastic springs, should a uniform modulus of subgrade reaction be used along the whole base of mat?  By using a bed of springs to simulate the flexible behaviour of mat subject to loads, care should be taken in selection of the modulus of subgrade reaction. In fact, the modulus of subgrade reaction depends on many factors like the width of the mat, the shape of the mat, the depth of founding level of the mat etc. In particular, the modulus of subgrade reaction is smaller at the center while it is larger near the mat’s edges. If a constant modulus of subgrade reaction is adopted throughout the width of the mat, then a more or less uniform settlement will result when subject to a uniform load. However, the actual behaviour is that settlement in the center is higher than that at side edges. Consequently, it leads to an underestimation of bending moment by 18% to 25% as suggested by Donald P. Coduto (1994).  In general, a constant value of modulus of subgrade reaction is normally applied for structure with a rigid superstructure and the rigid foundation. However, a variable modulus of subgrade reaction is adopted instead for non-rigid superstructure and non-dominance of foundation rigidity to account for the effect of pressure bulbs.  29.What is the difference between direct circulation drilling and reverse circulation drilling?  For direct circulation drilling and reverse circulation drilling, the major difference in drilling method is related to the direction of movement of drilling fluid. For direct circulation drilling, the drilling fluid is circulated from the drill stem and then flows up the annulus between the outside of the drill stem and borehole wall. The drilling fluid that carries the drill cuttings flows to the surface and the subsequent settlement pits. Pumps are employed to lift the cuttings free fluid back to the drill stem. 200 Questions and Answers on Practical Civil Engineering Works Vincent T. H. CHU 75  For reverse circulation drilling, the direction of flow of drilling flow is opposite to that of direct circulation drilling. Drilling fluid flows from the annulus between the drill stem and hole wall to the drill stem. The drilling fluid is pumped to an nearby sump pits where cuttings are dropped and settled."
  }
]